{
  "source": "Pangea Reptile Blog",
  "source_url": "https://www.pangeareptile.com/blogs/blog",
  "scraped_at": "2025-12-29T10:28:56.122949",
  "total_articles": 20,
  "articles": [
    {
      "title": "Labor Day Weekend: A Time to Celebrate Our Team",
      "url": "https://www.pangeareptile.com/blogs/blog/labor-day-weekend-a-time-to-celebrate-our-team",
      "summary": "At Pangea Reptile, we believe in taking care of the people who take care of our customers. This Labor Day, we’re showing our appreciation for our hardworking team by giving them a well-deserved break....",
      "content": "At Pangea Reptile, we believe in taking care of the people who take care of our customers. This Labor Day, we’re showing our appreciation for our hardworking team by giving them a well-deserved break. Our employees will be clocking out early on Friday, August 29 at 1 PM EST to enjoy our Employee Appreciation Party. Operations will pause at that time to give our team time to have fun and relax. We’ll be back and ready to help on Tuesday morning. Here’s what that means for you: Orders that have not shipped after 1 PM EST on Friday 8/29 will not ship until Tuesday 9/2 at the earliest Overnight shipping will be temporarily unavailable starting Friday morning Our customer service team will also be offline during this time If you reach out to us over the weekend, please know we’ll get back to you as soon as we can once we return. Thank you for your patience and for supporting a company that puts people first. We hope you have a relaxing and joyful Labor Day!",
      "scraped_at": "2025-12-29T10:28:04.064261"
    },
    {
      "title": "The Pangea Pixel Story",
      "url": "https://www.pangeareptile.com/blogs/blog/the-pangea-pixel-story",
      "summary": "The Pixel trait has been heating up in the Crested Gecko community with conversations online, in podcasts, and of course at reptile expos. We have seen a lot of interest in the trait and sharing of re...",
      "content": "The Pixel trait has been heating up in the Crested Gecko community with conversations online, in podcasts, and of course at reptile expos. We have seen a lot of interest in the trait and sharing of research and discussion so far, which is incredibly encouraging for this trait and our community of crested gecko breeders. We know releasing our Tangerine Dreams stirred the pot, and begged the question “What’s up with Pangea’s Pixels?” We know you’re interested, so, here’s our pixel story: But first! Here is a key to help you understand the document: Traits are capitalized: Pixel, Tiger, Pinstripe, etc. Breeding groups are italicized:Tangerine Dream, Glow Stick, Pixel 1, etc. How It Started In 2018, Pangea discovered interesting geckos with unusual pattern distribution in our collection. These founding animals were made of hyper-tangerine animals with dark bases and were dubbed Tangerine Dream. This project was kept fairly quiet and small until recently. At the beginning of this project, we did not know much about it other than that it was special and we wanted to learn more. In 2022, we paired a Tangerine Dreammale with a Lilly White female. This group was called Glow Stick as the goal was to produce hyper-tangerine Lilly Whites, which we hoped would glow! Glow Stick produced ten animals, three of which were Lilly Whites, with one of those three picking up the tangerine trait. Although many non-Lilly Whites from this pair received the tangerine trait, the group was broken up before the 2023 season. In 2023, two pairs of our Tangerine Dream line were actively breeding. These two pairs were known as Tangerine Dream 1 and Tangerine Dream 2. These two groups produced 24 babies for that season with 100% of the hatchling phenotypes matching the parent’s main phenotype with minor variations in structure, color, and amount of pattern. See more on these pairing in our Groups section below. What’s in a Name While vending the Flora Fauna Conference in 2023, Pangea had some of our Tangerine Dream animals to show to the community for discussion. While looking at these geckos, some breeders remarked that the animals resembled what many called “Pixels” or “Super Pixels.” At that time, Pangea was not tracking the Pixel trait in the hobby and took these opinions with guarded excitement. Following that show, we were interested in this trait and began tracking and researching what breeders and collectors were saying about and calling Pixel. After comparing the pixel collection from our two groups to what was being called Pixel online, we began to notice ways to identify what we thought was the same trait. Based on our observations, most people working with Pixel have the same trait as Pangea, so Pangea adopted the term Pixel as a trait in ourTangerine Dream line. We gained a keen eye for these patterns through our observations and discovered other breeding groups creating the same Pixel phenotype in 2023. We now have a reason to believe that Pixel is amongst multiple Pangea XXX and Pangea Extreme Harlequin lineages, which is supported by our inheritance theory (see Pixel Inheritance below). Since then, Pangea has produced many Pixels and we’ve learned a thing or two about the trait.We are excited to offer our findings, so without further ado, let's begin! How to Understand and Describe the Phenotype. Pixel is a general pattern disruptor. White and orange patterns appear to disrupt or scatter resembling pixels or static. The edges of the affected pattern are always discretely ‘pixelated’ and do not display smooth edges or lines. Certain pattern expressions and trait combinations can make distinguishing the appearance of the Pixel trait more difficult. For example, high-coverage patterns can be too dense to produce the same disruption throughout and only show pixelation at the edges of the pattern. Additionally, pattern color is known to fade as animals grow, and traits like Snowflake may cause blending, disguising the distinctness of pattern disruption from the Pixel trait. Dorsum Identifying the Pixel trait is most easily done by looking at the dorsum. This is the most consistently affected area, especially at the dorsal ridges. The affected dorsa have disrupted patterns that can organize laterally or perpendicularly. Pixel does allow certain typical crested gecko dorsum features to display, including linear formation and Tiger breaks, but not all dorsal traits appear to exist when the Pixel trait is present like chevron or 'S' shaped pattern. Pinstripe Most Pixels in Pangea’s collection have laterally organized patterning between the dorsal ridges. This expression is often displayed as two thick lines with a thin base-color stripe on the spine. This expression resembles a “Super-Stripe” without the Pinstripe trait. This project and discussion have not been to debate Super-Stripe theories, however, it is worth mentioning that this display may raise new questions about Super-Stripe. A Pinstripe Pixel has yet to be documented at Pangea as of publishing this article. Although we at Pangea have not seen animals displaying full Pinstripes and Pixel simultaneously, we are not ruling out the possibility of them appearing together and plan to test this further. The animals we can confidently label as Pixel do not have the definitive Pinstripe characteristics. In our population of Pixels, dorsal crests are not strongly raised and organized into a tight line like the Pinstripe trait phenotype. The distinct lack of Pinstripe structural characteristics in our population suggests these traitscan not coexist. Most offspring from Glow Stick (see below) display Pinstripe. We believe these geckos are all heterozygous for Pixel and are working to demonstrate this by breeding them to geckos that are visual Homozygous for Pixel. We expect the outcome of these groups to help inform the Pinstripe-Pixel interaction. Laterals A crested gecko’s laterals are the areas on their sides, between the neck and tail, not including the limbs. On our Pixel laterals, pattern color consistently appears at the ventral ridges and near the dorsum. Pattern color found on the ventral ridge in our Pixel population extends upwards, typical of Harlequin pattern. Pixel significantly affects patterns on laterals, which can display a range of expressions. This variation depends on the amount of pattern present, if the pattern is more laterally organized, or if there is a significant perpendicular influence from Tiger. High coverage expression can prevent pattern distinction since there is no separation, which makes reliably identifying Pixel on laterals more difficult. High coverage patterns can be too dense to produce the same disruption throughout and only show ‘pixelation’ at the edges of the pattern. Unfortunately, this makes identifying Pixel on laterals difficult. Tiger with Pixel Tiger and Pixel coexist in individual phenotypes, however, this combination isn’t fully understood. It is unknown if Pixel is changing only the pattern distribution of Orange Pattern, White Pattern, and Tiger, or another unknown possibility. We have seen animals with dorsal breaks and lateral patterns broken perpendicularly, similar to what Tiger does on many Extreme Harlequins. Furthering the confusion, we have also observed a mottled pattern on multiple animals, like what some would call brindle. Pixel could be affecting the Tigering, pattern, or both. Tail The breeding community often seeks “het markers” and “tail markers” hoping for an incomplete dominant trait to improve their ability to identify genes and improve breeding outcomes. We have yet to find any tail patterns that are true in all cases. Many animals display a similar tail pattern, where the typical saddling of the white pattern on top and reverse-saddling of the dark on the bottom are evened into a straight border. However, we have noticed this pattern in other animals that do not express the Pixel phenotype or have any known relation to a Pixel, which suggests it is an unrelated trait. Very few animals display a connected ‘Y’ as the base of the tail joins the dorsal ridges with a majority having a break in between the tail and dorsal pattern. A majority of our adults have a connection from the dorsum pattern to the tail pattern. Inconsistencies in the tail pattern across all subjects suggest Pixel does not uniquely affect the tail pattern. The difference between juveniles and adults is likely due to pattern migration during ontogenesis. The even, straight border between tail colors on some individuals does raise our curiosity, but warrants separate research. Pixel Inheritance Our observations indicate the inheritance is recessive. This means heterozygous animals display no indication of the trait and only homozygous animals will express the phenotype without requirements of other genes or traits. The inheritance theory is consistent with the community’s general opinion and results from our breeding projects. Using our working description for the phenotype to identify when Pixel is present, we can extrapolate inheritance information based on the outcomes of breeding these animals. Our Tangerine Dream toTangerine Dream pairings have resulted in 100% inheritance of the main phenotype features. Visual-to-visual pairings always produce a visual.See Tangerine Dream 1 and Tangerine Dream 2 below. This consistency in phenotypes and inheritance from multiple groups demonstrates that an inheritable trait determines the phenotype. When we paired a Tangerine Dream male with a non-pixel female, none of the produced offspring exhibited the Pixel phenotype.See Glow Stickbelow. Through this, we can infer that if either of the parents is missing the gene altogether, their offspring will not show the trait. This eliminates the possibility of the pixel genotype being a dominant trait or an incomplete dominant trait because of the known heterozygosity and lack of any Pixel-related phenotypic differences between the offspring. As previously mentioned, we discovered breeding groups producing phenotypes that matched our description without the parents expressing the same phenotype. This means that non-visuals to non-visuals can produce visual Pixels. For this to happen each parent must have had one copy (heterozygous) of the gene that each contributed, resulting in the offspring having two copies of the gene (homozygous). Finally, a more recent Pixel project offspring demonstrates the recessive inheritance theory. A male from ourTangerine Dreamline was paired with a female from our Glowstickline. The male is homozygous for Pixel and the female is heterozygous for Pixel. This pair produced multiple hatchlings displaying the Hyper Tangerine and the Pixel phenotype.See Pixel 1 below for details. This outcome confirms the mode of inheritance to be recessive by offspring, with one visual parent and one visual grandparent on the opposite side, displaying the Pixel phenotype. The Future of Pangea Pixel Projects We have produced many animals that display the Pixel phenotype from multiple lineages, though we still question how it interacts with other traits. To help us understand the trait, improve upon our goals, and increase heterozygosity, we have dismantled our Tangerine Dream pairs in exchange for new pairs. Currently, we have several pairs put together for our Pixel project. All our pairs contain one confirmed Pixel and one gecko as a testing variable. Our testing geckos include suspected Pixels, non-visual parents of Pixels (presumed heterozygous), and non-visual offspring of Pixels (heterozygous). Pairs were chosen instead of groups to demonstrate the lineage of each animal with complete accuracy. We have several goals for these pairs. These goals include creating more outcrosses to expand the Pixel gene pool and improve heterozygosity, testing the mode of inheritance, improving crest and head structure, combining Pixel with new traits, and making more Pixels! The Pixel trait presents incredible possibilities by combining it with other traits for stunning combinations. We are excited to work with this trait and share our findings with you as we develop more information from our understanding of this inspiring trait. Subscribe to our newsletter or follow us on social media for more Pixel information and availability from Pangea. Head over to our available Pixels and see the possibilities for your next crested gecko! Groups These are past and present Pangea Pixel groups referenced above. This section offers further information and specificity for these breeding projects. Tangerine Dream 1 Tangerine Dream 1 (TD1) was a pair with the male and female displaying Pixel and Tangerine. Each animal has a nearly solid dorsal pattern. The male displays an Extreme Harlequin Pattern and Tigering. The female has a soft mottled Harlequin pattern. 100% of the Tangerine Dream 1 offspring display Pixel and Tangerine. Tangerine Dream 2 Tangerine Dream 2 was a trio consisting of one male and two females, each displaying the Pixel phenotype and Hyper Tangerine. The male from this group has a mottled appearance throughout his body. Both females from this group have less dorsal coverage and more broken patterns than their Tangerine Dream 1 counterparts. This group produced nine offspring, each displaying the Pixel Phenotype and Hyper Tangerine. This group of offspring displays mottled/brindled patterns and dorsal breaks while keeping consistent with the Pixel phenotype. This close-up of thedorsa from Tangerine Dream 2 parents and offspring exemplifies the pattern disruption of the Pixel trait without the influence of high coverage or solid dorsal pattern. Parents are featured at the top with offspring below. Glow Stick Glowstick consisted of a high-coverage Lily White male and a Tangerine Dream female. The Tangerine Dream female is homozygous for Pixel and possibly homozygous for Tangerine (aka Hyper Tangerine). The desaturation of color pattern with age makes determining how prevalent the Tangerine trait is with this individual difficult. All Glowstick offspring phenotypes display Tangerine which infers the dam is homozygous for Tangerine. Of the 10 offspring from Glow Stick, all display the Tangerine trait, three display the Lilly White trait, and none exhibit the Pixel phenotype. Pixel 1 Pixel 1 is the culmination of our Pixel project bringing together one of our favorite males, the former sire to Tangerine Dream 2 with a Lily White female from Glowstick. The male displays the Pixel phenotype Hyper Tangerine and has a mottled appearance throughout his body. The female is a Tangerine Lilly White and is heterozygous for Pixel. This combination of traits has eight possible outcomes seen in the combinations below. To date, this group has produced seven hatchlings. Of the first seven offspring from Pixel 1,two display the Pixel phenotype, two do not display the Pixel phenotype, and three display the Lilly White trait and possibly Pixel. Confirming the Pixel trait with the Lilly White geckos is difficult because it is not well known how the two traits will interact at their young age. Some community members suggest it takes a few months for this interaction to become apparent.",
      "scraped_at": "2025-12-29T10:28:06.756578"
    },
    {
      "title": "How to identify the seasonal light cycles for your pet reptile",
      "url": "https://www.pangeareptile.com/blogs/blog/how-to-identify-the-seasonal-light-cycles-for-your-pet-reptile",
      "summary": "As the seasons change and the days get shorter or longer, you might think to yourself “Should I be adjusting my reptile’s day/night cycle as well?” If your reptiles come from an area outside the tropi...",
      "content": "As the seasons change and the days get shorter or longer, you might think to yourself “Should I be adjusting my reptile’s day/night cycle as well?” If your reptiles come from an area outside the tropics, you should! Here is a guide to understanding seasonal light cycles for your pet reptile. The Importance of Light Cycles for Reptiles Day and night cycles are important for regulating the circadian rhythms of most animals, including reptiles. The further an animal’s habitat is from the equator, the more their day/night cycle changes with the season. These seasonal changes often result in hormonal and behavioral changes. This seasonal change is crucial to the well-being and development of many reptiles. To replicate your reptile’s natural environment, and facilitate natural behavior, you should adjust their light timing to replicate their natural habitat’s seasons. When to Change the Light Cycle We recommend adjusting quarterly to fit general seasonal changes. Quarterly adjustments are simplest to make every three months. We recommend changing times on the first of February (Spring), May (Summer) August (Fall), and November (Winter). These dates stay ahead of seasonal changes, and result in more accurate day/night cycles compared to changing times on the first day of each season. The Northern Hemisphere has seasons opposite to the Southern Hemisphere. If your pet’s native habitat is from a different hemisphere than where you keep it now, we recommend synchronizing their seasons to coincide with your local seasons. By synchronizing seasons, the light of your pets’ enclosure will coincide with the changes in natural light of your local seasons. If you live in an area that observes daylight saving time, do not adjust your reptile’s timers to match DST changes. Wild animals don’t observe daylight saving time, and your pet doesn’t need to either. A day/night timer makes maintaining your pet reptile's circadian rhythm easy! This article refers to seasonal light change, or astrological seasons, rather than meteorological seasons which refer to the in-atmosphere weather systems that occur worldwide. Meteorological seasons are more complicated and diverse than astrological seasons. You should take care to learn your pets’ natural habitats’ seasonal weather patterns for temperatureand humidity regulation. Here are some seasonal light cycles for commonly kept reptiles in the US. If your pet is not on the list continue to our method for finding your pets’ seasonal light cycle. Common Species Light Cycles Simplified How to find your reptile’s Day/Night cycles: Step 1: Determine your reptile’s native range. Google can be a valuable resource here if you use trustworthy sources; typically, the Wikipedia.org article for your reptile will be correct. If a trustworthy source cannot be found, the map for your reptile on iNaturalist.org can tell you where they have been spotted in the wild, though some areas of the world do not have access to this site. Step 2: Use Google Maps to find the coordinates of a centralized area of your reptile’s range. On your computer, open Google Maps. Right-click an area in the center of your pets’ native range on the map. Click the coordinates at the top of the resulting pop-up menu to copy them to your clipboard. OR on your phone, open Google Maps. Click an area in the center of your pets’ native range on the map. This will open a pop-up window. Scroll down to find the coordinates and click them. This will copy them to your clipboard. Step 3: Determine your reptile's Day/Night Cycle Navigate to https://www.timeanddate.com/sun/ Paste the coordinates from step 2 in the City Lookup search box Toggle the Sun Graph from Rise/Set Times to Day/Night Times To find your pet’s Summer and Winter Day/Night cycles, find the longest and shortest days respectively, and note the Day lengths. Your pet’s Night Lengths will be 24 minus the Day Length. Note: Spring and Fall’s cycles should always be approximately 12 hours of day, and 12 hours of night. The times you find for your pet’s Day/Night cycle can be recorded on our printable Day/Night cycle chart! Download this chart for free here and print one for your pet! While we recommend changing your reptile’s light timing at least four times per year, there is no reason you can’t do more! You can choose how much you want to refine your settings and adjustments by deciding how often you plan to change the light cycle. For more advanced husbandry and precision you could refine your adjustments to monthly, weekly, or even daily intervals but keep in mind the differences in hemispheres when interpreting the times and dates. However often you change it, your pet will benefit from a natural day and night cycle that resembles their native range. Your pet will be more likely to have the hormonal and behavioral changes that its species is accustomed to each season with these changes. This naturalistic approach will improve your reptiles’ health, well-being, and longevity.",
      "scraped_at": "2025-12-29T10:28:09.615762"
    },
    {
      "title": "Halogen vs Mercury Vapor Bulbs - This or That?",
      "url": "https://www.pangeareptile.com/blogs/blog/halogen-vs-mercury-vapor-bulbs-this-or-that",
      "summary": "Putting together the perfect lighting array for your reptile or amphibian's enclosure is essential for maintaining the conditions they need to thrive. For basking reptiles, there are many heating choi...",
      "content": "Putting together the perfect lighting array for your reptile or amphibian's enclosure is essential for maintaining the conditions they need to thrive. For basking reptiles, there are many heating choices to choose from including Halogen Heat Lamps and Self-Ballasted Mercury Vapor Bulbs. But which bulb is right for your reptile's basking spot? Let's compare and contrast these Halogen and Mercury Vapor Bulbs to determine which is the right light for your pet! You can also watch our video on the topic here! About The Bulbs: To start, let's describe the bulbs themselves! Halogens Bulbs Halogens bulbs are a type of incandescent bulb that use a tungsten filament surrounded by inert gas and a small amount of halogen gas. A reaction loop, known as a halogen cycle, allows for longer life, brighter light emission, and more efficient heat distribution than typical incandescent bulbs. Mercury Vapor Bulbs Self-ballasted mercury vapor bulbs in the reptile hobby are like linear fluorescent tubes in that they pass an electrical current through a small amount of vaporized mercury to emit light, heat and UVB. Comparing the Bulbs: Both Halogen and Mercury Vapor Bulbs emit heat, visible light, and UV-A light, making both great options for providing heat and light for your reptile. Halogens also have the benefits of being sturdy, relatively inexpensive, and dimmable. Dimmability is a particularly strong feature, as this allows them to be used with dimming thermostats to dial in exact temperatures. The downsides of using Halogen lamps is that the visible light emitted is very warm colored, and they do not emit UV-B, so a separate UV-B bulb would have to be provided alongside it. On the other hand, Mercury Vapor Bulbs do provide UV-B making them all-in-one basking spots for reptiles that love the sun! These bulbs are not dimmable, however, so care must be taken to use an appropriate wattage, and position it to create a basking spot with appropriate levels of heat and UV-B. They tend to carry a premium price tag, and are somewhat more fragile, so they should be handled with care. Our Recommendations: So, which heat lamp is right for you? We recommend Halogen heat lamps for keepers that already have a UV-B fixture, or are keeping a reptile with low UV-B requirements. They are also great for keepers looking for extra customizability, and keepers on a budget. We recommend Mercury Vapor Bulbs for keepers looking for an all-in-one solution to provide heat and UV-B light to a sun loving reptile. If you have any questions about whether halogen or mercury vapor bulbs are right for you and your reptile, feel free to contact us! We'd be happy to help you find the heat lamp that's perfect for your enclosure.",
      "scraped_at": "2025-12-29T10:28:11.827744"
    },
    {
      "title": "Understanding Cold Fusion: Lineage or Trait?",
      "url": "https://www.pangeareptile.com/blogs/blog/understanding-cold-fusion",
      "summary": "Cold Fusion has captured so much interest, although we know it can be a little confusing. So, we're here to offer a little help understanding it. There are two ways to think about the term \"Cold Fusio...",
      "content": "Cold Fusion has captured so much interest, although we know it can be a little confusing. So, we're here to offer a little help understanding it. There are two ways to think about the term \"Cold Fusion\": both as a lineage and as a trait. Lineage Drawn Tom Favazza of Geckological produced a dark-based gecko with a hypo combination that resulted in a base with a bluish tone when fired down, similar to lavender. This bluish tone inspired the name Cold Fusion for the male that would begin the titular lineage. Since then, this lineage has carried the name Cold Fusion. Many descendants display the bluish tone and other outcrosses carry the lineage from the capstone male. Trait Unpacked There is more to the bluish tone than a single trait, so let's unpack it. The phenotype we identify with the bluish tone is not a single trait but a combination of Black Base, Hypo, and Cold Fusion. The understanding of Cold Fusion as a trait is more obvious to the eye when Hypo is present and less obvious with a clean yellow base, as melanin has been minimized. Red-Cold Fusion-Hypo combinations still show the bluish tone when the hypo is more dominant in an animal and when they fire down. Want to See More? We bet you do! Have a look and shop our available Cold Fusion Crested Geckos! Still Curious? Check out the Cold Fusion section of the Foundation Genetics Trait Guide or watch our video with Matt Parks interviewing Tom Favazza about Cold Fusion!",
      "scraped_at": "2025-12-29T10:28:15.433300"
    },
    {
      "title": "Deep Heat Projectors vs Ceramic Heat Emitters - This or That?",
      "url": "https://www.pangeareptile.com/blogs/blog/deep-heat-projectors-vs-ceramic-heat-emitters-this-or-that",
      "summary": "On the surface, deep heat projectors(DHPs) and ceramic heat emitters (CHEs) seem like very similar products. Both solutions slot into a standard lightbulb socket and emit heat with little to no visibl...",
      "content": "On the surface, deep heat projectors(DHPs) and ceramic heat emitters (CHEs) seem like very similar products. Both solutions slot into a standard lightbulb socket and emit heat with little to no visible light. However, each of these solutions have strengths and weaknesses and are better suited for different purposes. Let’s talk about what each of these heat elements are good for, and build a framework so that you know which to get for your reptile’s enclosure! You can also watch our video on the topic here! Similarities First, let’s go over things that both DHPs and CHEs have in common! Both heating solutions are dimmable and can be controlled by dimming thermostats. Whether you choose a DHP, CHE, or both, they should be on dimmable thermostats or rheostats to avoid overheating your reptile. Both options emit little to no visible light. Deep heat projectors do emit a small amount of visible red light from their glowing filament, but this amount is negligible. This means both heaters can be used through the night if needed! Both heaters are widely available at many retailers including Pangea! Once you’ve made your decision, you can easily order your deep heat projector or ceramic heat emitter as well as any other supplies you may need! Deep heat projectors are great solutions for creating a basking spot for your reptile. They are found in a range of wattages from 50W all the way up to 150W. They differ from ceramic heat emitters by projecting infrared-A and B which are fantastic at penetrating the outer layers of skin, delivering heat deeply into your reptile’s tissue (hence deep heat). You can feel this effect yourself when holding your hand under a DHP, or standing in the sun; it’s the sort of heat that feels somewhat tingly to us. Deep heat projectors can also raise ambient temperatures to a degree when heat radiates off objects in the enclosure, however, ceramic heat emitters are better at raising ambient temps. The largest downside to deep heat projectors is their cost. While they’re efficient and long-lasting, your up-front cost will be higher than many other heating elements. In contrast to deep heat projectors, ceramic heat emitters are best used for raising ambient temperatures in your enclosures. Ceramic heat emitters emit infrared-C which doesn’t penetrate very well into the tissue of your reptile but instead radiates into the air, raising the overall temperature around it. While these wouldn’t be the best option for a basking spot requiring concentrated heat, they are fantastic for maintaining a baseline temperature in the enclosure and establishing a heat gradient. The downside of this radiant heat is how it affects humidity. Many keepers have reported that CHEs can quickly dry out an enclosure. This can of course be mitigated by regular misting, either by handor with an automated system. Ceramic Heat Emitters are found at many common wattages, including 50, 60, 80, 100, and 150W. In addition to this range though, smaller, Nano-sized Ceramic Heat Emitters exist which are great for enclosures that only need a bit of extra warmth. Which is best for me? Well, that depends on your reptile’s needs. A deep heat projector is a great choice if your reptile has a high heat requirement and needs a strong basking spot. If you need to maintain temperatures overnight or want to regulate temperatures without affecting light levels, a ceramic heat emitter is a great choice. The key thing to consider is that both heat elements are tools that can be used together or individually in lighting and heat arrays. Does your reptile need a basking spot? Consider adding a DHP for the deep tissue heating! How does your temperature gradient look, do you need extra heat for your warm side? Add a CHE to your array to boost those temps! The question changes from “Which is better, DHPs or CHEs?” to “Which of these tools is right for the task at hand?” Choose the heating element that fulfills the unanswered needs of your reptile, and continue to monitor temperatures and adjust your solutions accordingly!",
      "scraped_at": "2025-12-29T10:28:18.462250"
    },
    {
      "title": "Grapevine Branches vs Ghost Wood Branches - This or That?",
      "url": "https://www.pangeareptile.com/blogs/blog/grapevine-branches-vs-ghost-wood-branches-this-or-that",
      "summary": "When building hardscape for your reptile or amphibian's enclosure, there are many varieties of branches to choose from. Of them, Grapevine and Ghost Wood are some of our favorite choices. However, the...",
      "content": "When building hardscape for your reptile or amphibian's enclosure, there are many varieties of branches to choose from. Of them, Grapevine and Ghost Wood are some of our favorite choices. However, these branches have different properties that make them better for some enclosures over others. Let's compare and contrast Grapevine and Ghost Wood to determine which is the right branch for your pet's enclosure! You can also watch our video on the topic here! The Branches: To start, let's describe the branches themselves! Grapevine that is sold as décor for the reptile and amphibian hobbies is a knobby light-colored wood harvested from vineyards as a by-product from grape production. It is sandblasted to remove its bark, and comes in wild knobby branchesand tunnels. Ghostwood branches are the thicker pieces of wood harvested from Manzanita trees. It is also sandblasted to remove its bark, and is known for its colorful twisting branches. You can also purchase smaller Manzanita branches, though they lack the colored bands are not typically identified as Ghostwood. Comparison Criteria: To compare these woods, we will be going over their: Mold Resistance Sustainability Suitability for Different Species Cost Mold Resistance: Mold resistance is an important consideration for all reptile and amphibian enclosures, but especially so for high-humidity environments. Both of these wood varieties, as well as all décor should be regularly inspected and maintained to prevent mold buildup. In a bioactivesetup, a clean-up crew with Springtailsis a great addition to help keep the mold at bay! Grapevine is less dense and more porous than Ghostwood, making it more susceptilbe to mold and fungal growth. Additionally, with all of it's twists, knobs, and divots, these branches can be difficult to cleanif mold buildup begins. Ghostwood on the other hand, is dense and less porous making it more resistant to mold and decay. We will often use it in our high humidity enclosures due to its low maintenance requirements and the colors displayed when misted. A hypo yellow Lilly White Crested Gecko on damp ghostwood. Sustainability: Both of these woods rank about the same in regards to sustainability. Grapevine, in particular is a by-product of grape production. When used for reptile enclosures, these vines that would otherwise go to waste, find a new purpose as a reptile's favorite branch! Ghostwood's harvesting practices can also be considered sustainable. Ghostwood is typically harvested from dead or dying trees in scrubland desert regions; primarily from areas where it would otherwise decompose. When done responsibly, it can be sustainable as it doesn't involve cutting down live trees and can help clean up natural areas. Both variety's sustainability depends significantly on the harvesting practices employed, so not every sources of either wood type is guaranteed to be sustainable. Suitability for Different Species: Both varieties of wood are suitable for a wide range of reptile species. Grapevine is highly versatile with its irregular shape and varying diameters. It offers excellent climbing opportunities for arboreal reptiles like chameleons, geckos, and some snakes. It does loose some points in this category due to its susceptibility to mold, however. Ghostwood is also incredibly versatile, with its striking appearance and smooth texture lending itself well to many different enclosures. Branchier pieces make great climbing structures for arboreal reptiles, and larger pieces can make great basking spots for terrestrial reptiles. It also works great in both dry and wet environments with a desert-like appearance when dry and rich colors when wet. Cost: Cost is, of course going to be a major determining factor for many keepers. Grapevine is generally the more affordable option of the two. Being a byproduct of the grape industry helps keep supply up, driving cost down. Larger, more complex pieces of grapevine will cost more, but less so than similar pieces of more premium woods. Speaking of premium, Ghostwood falls neatly into that category. It's unique appearance, durability, and the process involved in harvesting and preparing it all contribute to its premium price tag. But, if you are willing to invest in it, its striking appearance, and lower need for maintenance make it well worth it! Our Recommendations: So, which branch is right for you? If you are looking for an affordable option for a reptile without high humidity requirements, then Grapevine is a great choice for you! If you are looking for a more visually striking branch that looks great in any environment, that holds up to high humidity, and cost is not an issue, than Ghostwood is a fantastic option. There is also no reason a combination of the two can't be used! If the enclosure is suited for it, using both Grapevine and Ghostwood can provide some great contrast, giving your reptile more variety, and your eye more visual interest!",
      "scraped_at": "2025-12-29T10:28:20.778914"
    },
    {
      "title": "5 Great Conservation Organizations to Support",
      "url": "https://www.pangeareptile.com/blogs/blog/five-great-herpetological-conservation-organizations-to-support",
      "summary": "As reptile lovers, we love all wildlife conservation efforts, but even more so for efforts to support the conservation of reptiles and amphibians. We've put together a short list of five great organiz...",
      "content": "As reptile lovers, we love all wildlife conservation efforts, but even more so for efforts to support the conservation of reptiles and amphibians. We've put together a short list of five great organizations protecting reptiles that you can feel good about supporting today. IUCN - International Union for Conservation of Nature While not specifically a herpetological conservation organization, the IUCN is a fantastic organization to support regardless! It is a union of government and civil society organizations working to advance sustainable development and create a world that values and conserves nature. The IUCN is the organization behind the IUCN Red List which details over 40,000 threatened species. Learn more and support the IUCN at iucn.org ARC - Amphibian and Reptile Conservancy ARC is a nonprofit focused on identifying and conserving the highest priority places for amphibians and reptiles in the Untied States. They protect endangered amphibians and reptiles through a strategic, scientific, and passionate approach. They work towards conservation through population monitoring, species research, and active conservation, working to restore habitats, ecosystems, and populations. Support ARC at arcprotects.org. TTPG - Turtle and Tortoise Preservation Group Founded in 1996 to spread awareness about the disappearance of turtles throughout the world. TTPG's mission is to ensure survival of the world's turtles and tortoises through captive breeding. They carry out this mission through educational outreach, and providing knowledge bases for those that want to get involved. Support TTPG through their website, ttpg.org! IHS - The International Herpetological Symposium The IHS is an organization that holds and annual symposium for the dissemination of information and research pertaining to the natural history, conservation biology, captive management and propagation of amphibians and reptiles. They seek to build a community open to all individuals who are interested in reptiles and amphibians and provide a platform that fosters the exchange of ideas and information. In addition to hosting the symposium, they offer awards and grants that go towards conservational efforts. You can support the IHS through their site at iherpsymp.org. US ARK - United States Association of Reptile Keepers US ARK is a science, education and conservation-based advocacy group for the responsible private ownership of reptiles and amphibians. They fight for keeper rights while also pushing for conservation through viable captive reptile populations. They seek to establish captive breeding programs for as many species as possible, and to prevent these populations from becoming outlawed. Pangea has been a long-time advocate of USARK, and is a gold member. You can join us in supporting them at usark.org. Conservation is incredibly important to reptile keepers. We've been able to love these animals because they happen to exist in a time when we do. However, as the world changes and natural habitats become damaged, more and more species of reptiles and amphibians are lost every year. We hope you will join us in supporting one or more of these great conservation organizations, and to do what you can to make a difference.",
      "scraped_at": "2025-12-29T10:28:23.747051"
    },
    {
      "title": "How To Ship Your Reptiles",
      "url": "https://www.pangeareptile.com/blogs/blog/how-to-ship-your-reptiles",
      "summary": "For those unexperienced with shipping reptiles, we understand the process can be daunting and stressful. Here at Pangea, though, we ship reptiles all the time, so we've got quite a bit of experience a...",
      "content": "For those unexperienced with shipping reptiles, we understand the process can be daunting and stressful. Here at Pangea, though, we ship reptiles all the time, so we've got quite a bit of experience and know-how to make sure it's done right, and your reptiles get shipped safely. We've created this guide to help those new to reptile shipping, or anyone who needs a refresher. We've also made a YouTube video on the topic, where our General Manager, Jon, takes you through the steps! Shipping Supplies Let's start by going over the supplies you will need for your reptile. Cups Your reptile is going to be contained in a plastic deli cup, or similar container. The main things to consider when choosing a cup are: What size is appropriate for my reptile? Can the cup be secured tightly to prevent escape? How is my reptile going to breathe? The cup should be just large enough to fit your reptile and the paper towel you add to it. If the cup is too large, the reptile won't feel secure, and can get jostled around in shipping. For first time shippers, it may feel odd putting your reptile in such a small container, but trust us; it's the right call. For crested geckos in particular, we pack juveniles in 8 oz. cups, sub-adults or tailless adults in 12 or 16 oz. cups, and adults with tails in 32 oz. cups. All of these should be lined with paper towel, regardless of the size. Temperature Control Depending on the ambient temperatures of your area and your recipients area, you will need to pack some temperature control packs as well, to ensure your reptile stays at their ideal temperatures. No matter the temperature, we always include a Pangea Temp-Safe Phase Pack. These packs use phase-change technology to stabilize temperatures around 74°F. This is great for when temps are mild as it acts to stabilize temperatures in the case of any unexpected spikes or dips. It's also great for extreme temperatures alongside hot or cold packs to better control the temperatures your reptile is exposed to. When temperatures are higher (75-85°F), Adding a bagged ice pack is needed to prevent overheating. When temperatures are lower (50°F or lower), a heat pack is needed. Packing Paper We recommend using a thin packing paper, such as newsprint to keep your reptile secure and well-insulated. You can even use actual newspapers! Packing materials to avoid are thicker packing papers, glossy ads that come in newspapers, bubble wrap, and packing peanuts. You will also need paper towel for inside the cup; do not use paper towel for outer packing paper. An Insulated Box Now that you've figured out everything that has to go in the box, you can pick out which box is right for you. Measure your contents, including any bonuses you want to add, such as packets of Crested Gecko Diet, or care guides, and choose a box that can fit it all snugly. The boxes we sell for shipping reptiles include 3/4\" foam insulation panels, so account for those as well. You will need a box that fits: The reptile in its cup Packing paper on all sides of the reptile as well as the included foam inserts Temperature control packs Any bonuses you want to include. When to Ship At Pangea, we only ship reptiles Monday through Wednesday. Since shipping will be done overnight, this ensures the reptile won't get lost in transit over the weekend when it is more difficult to track it down and ensure it is getting found and taken care of. Basically, it allows for an easier time working with shipping representatives in the case that something goes wrong. We also only ship when temperatures are between 32°F and 80°F on both our end and the recipient's end. Temperatures outside this range can be dangerous for your reptile. The most important part of deciding when to ship though, is coordinating with your recipient. Make sure you are both clear on the expected transit windows, so that the reptile can be brought inside and taken care of properly. Packing your Reptile So, now that you've gotten all your supplies and determined when to ship, it's time to actually pack your reptile. If you are a visual learner, watch the linked YouTube video above for a demonstration! Begin by putting your reptile in its cup. Make a concave shape with dry paper towel, and place it in the cup. Place the reptile in the cup, then use a smaller piece of paper towel on top to keep the reptile feeling safe and secure. Next, assemble your box, making sure to tape all seams to ensure it can't break open. Line the box with the foam inserts, followed by a layer of packing paper at the bottom. You'll then add your temperature control packs. If using just a phase pack, the reptile can be placed directly on top of it. However, if you use a heat or a cold pack, we recommend separating the pack from your reptile with a layer of paper as well as placing a phase pack between them. This helps prevent your reptile from getting dangerously hot or cold. Once your temperature control packs are inside and insulated, place your reptile in the box. Add paper around the sides of the reptile to keep it snug and secure, and insulate it further. Add another layer of paper on top of the reptile, place any extra goodies you're including on top of that, and add the top layer of foam, and then you are ready to seal the box! Close the box and once again tape all the seams to ensure it can't break open. Then, poke a hole in the box, making sure you poke through the foam insert as well to allow your reptile to breathe. This hole is especially important when using heat packs as those will also use oxygen. Labeling Once your reptile is packed, you will need to add Lacey Act information to the side. The boxes we sell include a space for Lacey Act labeling, but you can also download and print off the label below. For the Lacey Act, you will need to designate \"Wildlife - Harmless Live Reptiles\" are contained inside. You will also need to designate the quantity and species contained in your shipment. We typically include both the scientific name as well as the common name. For example a label for a single crested gecko would say \"1 Correlophus ciliatus (Crested Gecko).\" Once that is on there, find a place to adhere your shipping label. We also recommend adding additional fragile, and \"perishable - live animal\" labeling to other sides so that a delivery driver knows to be gentle. Once it's labeled, follow your courier's pick-up procedures, and your reptile will be on it's way! If you ever have any specific questions for shipping reptiles, feel free to reach out to us through messages on our Instagram or Facebook, and we will do our best to help you out!",
      "scraped_at": "2025-12-29T10:28:25.453394"
    },
    {
      "title": "Introducing the Pangea MicroDish System",
      "url": "https://www.pangeareptile.com/blogs/blog/introducing-the-pangea-microdish-system",
      "summary": "Created in partnership with LucaTech3D, the Pangea MicroDishes were built to give keepers of arboreal geckos such as Crested Geckos, Gargoyle Geckos, Day Geckos, and Mourning Geckos a sleek, professio...",
      "content": "Created in partnership with LucaTech3D, the Pangea MicroDishes were built to give keepers of arboreal geckos such as Crested Geckos, Gargoyle Geckos, Day Geckos, and Mourning Geckos a sleek, professional option for feeding their reptiles. The Pangea MicroDishes come in five varieties: A large dish with a branch-mount system A small dish with a branch-mount system A small dish with a surface-mount system An extra-small double dish with a branch-mount system An extra-small double dish with a surface-mount system The large dish is ideal for geckos in the size range of adult crested geckos. It uses a magnetic socket that zip-ties onto any sturdy branch or vine in your enclosure that the dish can be easily attached to. While the magnet mount isn't strong enough to hold a leachianus, it's plenty strong to support an adventurous crested gecko that decides to play in its food instead of eating it. The small and extra-small dishes are great for baby crested geckos or microgeckos such as mourning geckos. These ones share the same magnetic mounting system and have two options for how you'd like to mount them. The first is a branch-mounting system that zipties to a branch in the enclosure, just like the large dish. The second is a surface-mount system that uses an adhesive pad to adhere the magnet mount to the enclosure wall. We're excited about the branch-mount options, as they allow you to move your feeding dish off the wall of the enclosure and give you more options in building your ideal enclosure. All dishes are made from a durable, food-safe plastic that is very easy to clean. They also feature the convenience of being mountable to metal surfaces (such as a baker's rack) or the included adhesive mounting dots. This allows for convenient storage, and quick filling. The Pangea MicroDishes are available today in all varieties! Order yours at pangeareptile.com",
      "scraped_at": "2025-12-29T10:28:27.790775"
    },
    {
      "title": "Questions about Pangea Crested Gecko Diet Answered",
      "url": "https://www.pangeareptile.com/blogs/blog/questions-about-pangea-crested-gecko-diet-answered",
      "summary": "We receive questions about our award-winning Crested Gecko Diet all the time. When so many people use it, people are bound to be curious about things, so we opened the door to questions and asked our ...",
      "content": "We receive questions about our award-winning Crested Gecko Diet all the time. When so many people use it, people are bound to be curious about things, so we opened the door to questions and asked our social media followers, \"what questions do you have about Pangea Crested Gecko diet?\" The answers to their questions, as well as some frequently asked questions are below! We also made a YouTube video to answer the questions if that format is more your style. Q: The label is different. Has the diet changed? A: The short answer is nutrition-wise no, the overall diet has not changed. The long answer is that small changes have been made to the vitamins and iron sources used. We used to use a pre-mixed vitamin blend, but switched to making the mix ourselves to better control the quality of the vitamins in the diet. We also changed the iron source used from Ferrous Fumarate to Ferric Pyrophosphate. This change was made because Ferrous Fumarate oftentimes led to discoloration in the diet, and sometimes increased instances of molding. So essentially any changes made to the diet were not to the recipe, but to nutrient sources so we could improve quality. Additionally, the way ingredients are arranged on the bag changes from time to time to meet various state regulations. In these cases, there are no changes to the diet at all, just changes to how ingredients are displayed. Q: Why is there mineral oil in the diet? A: There is no long mineral oil in the diet. It was part of a premade vitamin mix that we were using that got replaced when we switched to our own vitamin mixture. Q: What is the most popular diet? A: Pangea With Insects is the most popular diet overall. It is closely followed by Watermelon, Fig and Insect, and Growth and Breeding which are all tied for second. Q: What are these white chunks? A: White chunks in the diet are either potassium sorbate (a preservative) or coconut. Sometimes, larger bits make it into the end product, but these are safe for consumption. Q: What are these hard black things? A: Hard black pieces in the diet are typically pieces of ground-up insect meal. We use meal made from house crickets, mealworms and black soldier fly larvae, and sometimes there are slightly larger chunks mixed in. These will never be anything larger than your gecko can safely digest. Q: Why is my diet a different color? A: Pangea Crested Gecko diet never used artificial color, so any coloration of the diet, like the pink color of our Watermelon Diet, comes directly from the fruits and other ingredients. Seasonal variations in the fruits can oftentimes result in slightly different colors. Q: What is the right feeding schedule? A: For Crested Geckos, we recommend the following schedule: To encourage growth: feed daily, or alternate with live food. To maintain weight: feed 3-5 times per week. While breeding: feed daily, or alternate with live food. Q: How much diet should I offer? A: Most juvenile Crested and Gargoyle geckos should receive about 1/16 oz. or a dime-sized portion. Sub-adults should receive 1/8 oz or a nickel-sized portion. Adults will need 1/4 to 1/2 oz. or filling the bottom of one of our small dishes halfway up to the lip. For a demonstration of portioning the diet, check out our YouTube video below on preparing the diet! Q: How long does the diet last? A: Prepared mix is good for up to 7 days if refrigerated in a sealed container, or up to 24 hours in an enclosure. Dry mix is good for 6 months at room temperature, or 1 year if refrigerated. Q: Why does my diet go bad after a day? A: All of our diets contain milk protein which is shelf stable when dry, but when rehydrated will spoil after a day at terrarium temperatures. As you can imagine, if you left a fruit smoothie in the New Caledonian jungle for a day, it would likely go bad. We always recommend removing uneaten diet after 24 hours. Q: Why does my gecko diet smell bad? A: Mixed diet stored in a warm area can begin to ferment and smell bad after a few days. If you store mixed diet, always refrigerate it. We also recommend storing dry mix in a cool, dry place or refrigerating it if possible to maintain freshness. If a new bag of mix smells bad, please contact us immediately. Q: Why can't you freeze the diet? Asked by meb9998 A: We do not recommend freezing the diet. Although we have no nutritional data, we know that the crystallization process of freezing can destroy the cell structure of the natural products, which in turn could alter the nutritional value. Q: Which diet is recommended for species other than Crested Geckos? A: It really depends on the species. Look to other keepers of the species you are interested in keeping, and see what they are offering their reptile. The diets were created with Crested Geckos in mind, so they may not be the best solution for other species. Q: Are there any new diets in the works? Asked by many people! A: Yes! We have more diets in development! We can't give any additional details yet, but we have new flavors and diets for other reptiles in the works. Q: What's the best flavor for picky eaters? Asked by andresitofl A: This of course depends on your particular picky eater and their tastes, but we always recommend Fig and Insect for picky eaters. It's the only complete Pangea diet that doesn't use banana powder, so geckos that don't respond to banana tend to like it. Q: What was the development process like? And what research is currently being done to assure the diet is giving the animals everything they need to thrive? Asked by 503menagerie A: We first come up with the formula for the specific species with veterinarians and animal dieticians using optimal ingredients for digestion and absorption. We then test it on our animals for several years to understand how the animals react and grow on our diets. If we ever see anything concerning, we stop the testing and seek advice from the vet and describe what happens to the nutritionist. Q: Is there research for plant proteins being digestible/bio-available? Asked by firegolemgeckos A: There is research on pea proteins being bio-available for Crested Geckos, however we've chosen not to use them as the milk and egg proteins we have used have proven to be very bio-available, and they are not something we want to change. Q: Why do you continue selling through Amazon knowing their storage practices have ruined several batches and killed geckos? Asked by sad.phanboy A: This is the first time we've heard of this issue with Amazon! If any issues like this ever arise, please contact us immediately, and provide us with the lot number and information about when the diet was purchased. Typically, if any diet becomes close to expiring at Amazon, it gets sent back to us. Additionally, a lot of diet gets sold through Amazon, so their stock rarely sits in a warehouse for a long time. We have no reason to believe Amazon's warehouse conditions are ruining batches, as many other natural products are also sold through Amazon without issue. Q: Will you guys ever get to selling at chain pet stores? Asked by katkondakoff A: We currently have no plans to sell to chain pet stores. We want to remain a company that is tied to the reptile hobby and is readily available for our customers. Selling our product through independent stores, as well as directly from us allows us to better connect with the community. Bringing in chain stores adds another layer that we are unable to manage at this time. Q: How do we actually know that it is a balanced diet? Have you considered getting your food tested through a third party company? Asked by idyllic.ilash A: We know it's a balanced diet through scientific research and studies done by nutritionists. Additionally, through feeding our own geckos, and through feedback from our customers, we know geckos thrive on our diets. We also regularly get lab analysis done on batches of our diets to ensure the macronutrients in the diet continue to be where they need to be. Q: What makes your diet better than all the rest? Asked by danddcrestys A: Something that sets our diet apart from the rest is the use of highly bioavailable proteins from milk and egg. We also take pride in having a wide variety of complete diets so that picky geckos have options, and to allow for variety in your geckos diet. Q: Do all flavors have everything geckos need to thrive? Asked by agnes_cuz_why_not A: All diets except for treat have everything geckos need to thrive. Treat is a low-protein version of the diet that can be fed as the fruit portion of your gecko's diet in addition to live insect feedings. We also suggest live insect feeding while using a complete diet to add variety and enrichment for your geckos. Q: Is there a problem getting stuff to the UK? Asked by stuart7364 A: Exportation to many countries including the UK is difficult due to the animal proteins in the diet. Customs regulations in many countries are strict, so if you find there is a lack of diet in your country, it is likely due to difficulties in exportation and customs. Q: Have you ever tried mixing flavors? Maybe you even have a mixture combo to recommend? Asked by witch_alien_is_he A: We have mixed diets before, but we don't have any combos to recommend. The most common use case for mixing diets is to encourage a feeding response from picky geckos. The combo that work for any particular picky eater is entirely reliant on that gecko. Q: What other fruit bases have you tried that either were good but very costly, or simply was a fruit the geckos hated? Has Jackfruit or Durian ever been tried? Asked by Hooves and Claws \"Reptihaus\" A: Guava, peach, and apple have all been tried before, but did not work out. The most difficult part of starting development with a new fruit is figuring out the nutritional value of the selected fruit and balancing them with the vitamins and other ingredients. The aforementioned fruits didn't make the cut due to nutritional balancing issues. We haven't tried jackfruit or durian yet, but those are good suggestions! We'll look into incorporating them! If you ever have any other food suggestions, we'd love to hear them. Thank you all for your amazing questions about our diet! If you ever have more questions, always feel free to ask us through our Instagram or Facebook DMs!",
      "scraped_at": "2025-12-29T10:28:29.903034"
    },
    {
      "title": "Pangea Jack-o-Lantern Stencils",
      "url": "https://www.pangeareptile.com/blogs/blog/pangea-jack-o-lantern-stencils",
      "summary": "Want to share your love for geckos this Halloween? We put together some Jack-o-lantern stencils based on various Pangea designs for you to use! You can download them here! Three of them are basic silh...",
      "content": "Want to share your love for geckos this Halloween? We put together some Jack-o-lantern stencils based on various Pangea designs for you to use! You can download them here! Three of them are basic silhouette stencils that are simply traced and cut out, and two of them are more advanced designs that require a chisel to shave away parts of the pumpkin. We recommend having a small knife for the little details like the toes on the geckos If you use one of the stencils, tag us in a post on Instagram or Facebook! We’d love to see how your Jack-o-lanterns turn out!",
      "scraped_at": "2025-12-29T10:28:32.913354"
    },
    {
      "title": "Considerations for Building a Bioactive Enclosure",
      "url": "https://www.pangeareptile.com/blogs/blog/what-you-should-consider-before-building-a-bioactive-enclosure",
      "summary": "Bioactive enclosures are very attractive options for your pet reptile or amphibian! It’s hard not to fall in love with the idea of a miniature ecosystem thriving in your care. But do you know what you...",
      "content": "Bioactive enclosures are very attractive options for your pet reptile or amphibian! It’s hard not to fall in love with the idea of a miniature ecosystem thriving in your care. But do you know what you need to consider while building one? We created this blog post as a resource, so you know which questions you need to ask while planning your next bioactive build! We have a worksheet you can download here and write notes on as you plan your build! When working through this blog and its accompanying worksheet, you may need to revisit sections once you’ve completed others, as many answers to some questions inform or complicate others. Let’s get started! Who is this terrarium for? The first thing you need to ask yourself when planning your build is “What animal is this terrarium for?” It might seem like an obvious question, but the answer informs all the decisions you’ll need to make when choosing your terrarium’s parts. The first thing this informs is what style enclosure you’ll need to get for your animal. If your animal is arboreal, you’ll need a tall enclosure with plenty of room for climbing and enough horizontal space for jumping. If it’s terrestrial, your enclosure will need to favor floor space over height. Finally, if it’s fossorial, aquatic, or semi-aquatic, you’ll need horizontal space with enough depth to add plenty of substrate for burrowing, or water for swimming. Some animals may even fit into multiple categories, so you will need to plan on getting or building an enclosure. How much space will you need? The next thing you’ll need to ask for your build is “How big should the enclosure be?” A good place to start is the care guides you can find online for your animal. Start with the minimum recommended size for your animal and come back to this question later once you’ve started to make decisions for hardscaping and plants. You’ll have to consider how much space your substrate, backgrounds, branches, water features, and other elements will take up. You’ll also need to take into account that live plants will grow over time and will use more space unless trimmed. Once these elements are accounted for, consider how much room is left and ask yourself the following: Is this enough space for my animal to exercise while exploring and foraging? Is there space for temperature and humidity gradients, and is there room in those microclimates for my animal? Of course, space minimums are just the least amount of space needed, so if you can afford it, feel free to go bigger and offer your animal even more space to thrive and explore! While planning your enclosure size, also consider where in your home you’ll be placing the enclosure! It will need to be away from direct sunlight and not in front of a vent to avoid temperature issues. Speaking of maintaining proper temperatures… What environment is best for my animal? You’ll need to ask yourself, “What environment is my animal from, and how am I going to simulate it in my enclosure?” Consulting your animal care guides will give you suggested temperature and humidity ranges to start building the proper environment. Once you’ve determined the appropriate environment, you’ll need to figure out how you will use light, heat, and water elements to simulate it. Lighting and Heat Most reptiles benefit from UVB, and it should be considered for all reptile enclosures. Your animal care guide should tell you what UVI is best for your animal and recommend some bulb options. While UVB T5s can support some plants, if you’re going to have live plants, adding an LED bulb to your lighting array will be significantly better for sustaining healthy plants. Finally, for your lighting array think about how you are going to provide heat for your animal. Elements like halogen bulbs and ceramic heat emitters are great for ambient and basking heat but can speed up the evaporation of humidity, which is good for arid environments, but sometimes overpowering for humid environments. Enclosure tops have a finite amount of space making light planning and placement important when using multiple bulbs. You’ll also need to consider shade as well. All animals need an option to escape heat and UVB, so if light is spread out too much, there will be no escape. We recommend keeping lights close together when possible. For arboreal set-ups specifically which may have limited horizontal space, we recommend placing lights towards the front of the terrarium, allowing for shade in the back. For more horizontally oriented set-ups, you can choose one side of the enclosure for light and the other for shade. Ideally, your plants will also provide shady areas for your animal. This method also allows you to limit escaping humidity by covering part of the screen top with something like a Pangea Acrylic Insert. Humidity While planning your lighting, also consider which humidity elements you’ll need to add. If you plan on adding a misting system, dripper, or fogger, you’ll need to account for any space these elements will take on your enclosure’s top. If your animal requires misting or fogging, we recommend aiming the misting head or fogger hose toward your plants both for the atmosphere and to offer places for water droplets to collect that your animal can drink from. What’s going in my terrarium? Hardscaping, or the solid elements in your enclosure creates the structure of the habitat and makes a huge difference in the usability and aesthetics of the enclosure. Your reptile’s natural behavior will help determine which elements to use for the hardscaping. Wood Most reptiles and amphibians benefit from some sort of wood in their enclosure. Wood offers climbing options, visual barriers, and can help aid shedding. For arid and semi-arid setups, many kinds of wood will work great, such as grapevineor cork bark. In more humid environments, however, you’ll need to be more careful in choosing your wood so that you select a type that can tolerate the atmosphere inside without rotting or excessively molding. For example, a wood like manzanita would be a better choice than grapevine for tropical habitats. You’ll want to avoid resinous wood, treated wood, or any wet wood for any enclosure because of the dangers they pose to your animals. Whether you buy from a pet retailer like us or harvest the branches locally, make sure you know the species of wood is non-toxic for your animal, and sanitize the wood. You can use heat, placing the wood in an oven set to 220°F (104°C) for 30 minutes to kill off parasites, bacteria, and other biologicals that could be harmful to your pet. Rock and Stone Many enclosures, especially arid and aquatic ones, benefit from rocks both functionally and aesthetically. Using flagstone to create Retes stacks is one of the most effective ways to use rocks to benefit many reptiles. When choosing rocks to incorporate, like wood, ensure the stone is non-toxic. Additionally, some stone leaches minerality, and that will also need to be safe for your pet. The aquarium hobby has established a wealth of knowledge about rocks suitable for enclosures, so we recommend referencing their knowledge when determining the safety for your animal. Like wood, you’ll want to sanitize your rocks as well. We recommend using heat over chemical sanitization as many rocks are porous. Scrubbing the rocks, and then boiling them for about 10 minutes is a good way to do so. Other Materials In addition to natural wood and stone, artificial plants, hides, and rocks can be added as well. While plastic pieces may clash with the natural aesthetic of your enclosure, these items are often function-first inclusions that may provide great benefits to your animal. Of course, like everything else, do your research on any artificial items and read reviews to make sure they’re a good fit for your animal. Placing Your Hardscape Now that you’ve determined what’s going in the terrarium, you’ll want to develop a plan for how your hardscape will be placed in the enclosure. First and foremost, consider your animal’s safety. Heavy objects need to be secured to the bottom of the tank, and no item should be placed in a position that is easily toppled over or could collapse onto your animal. Additionally, make sure there won’t be any unintended hiding places in the enclosure that your animal can get stuck or trapped in. After safety, functionality is the next most important consideration in planning your hardscape. All elements should be intentionally placed at usable angles for your specific animal. If this pet is new to you, do your research for what is best for it. If you’re upgrading an existing pet’s enclosure, observe your pet’s preferences, and construct your plan to suit them. Branches at horizontal and diagonal angles work well for most set-ups, but arboreal animals will need vertical climbing options as well. You’ll also want to consider where your animal will be at different times of the day. For example, branches and stones should be placed in synchronicity with basking lights, choosing appropriately sized and angled platforms for an animal to soak in heat. Additionally, distance from your UVB bulb should be factored into this placement to ensure your animal is receiving an appropriate UV index. Finally, regarding functionality, hiding places need to be created in your hardscape. These spaces should be large enough to fit the animal, but not so big that they’re afraid a predator could join them. The best practice would be to offer multiple hiding places; some with one entrance, and others with multiple. These spaces should also be at different ends of your gradients. If housing multiple animals, you’ll need additional basking spots and hiding places. Finishing Touches Once safety and functionality have been accounted for, you can think about aesthetic choices. We won’t get too in-depth with aesthetics in this blog, but you may want to incorporate art principles such as movement and depth in your plan. Additionally, this is a good time to determine the placement of your dishes. These are often the last things placed in the enclosure, but you’ll want to incorporate them into your plan to ensure there is room for appropriate food and water dishes in appropriate locations. What Substrate does my enclosure need? Your substrate is another element that will likely have recommendations found in online care guides. It is also something that will be primarily informed by your animal’s natural habitat. Generally, you will want a substrate that drains well for arid and semi-arid set ups. Tropical and sub-tropical substrates usually have more absorbent materials that help maintain humidity for your pet. You will also need to ensure the substrate you use can support any plants you intend to add if you’ll be planting them directly in the substrate. Organic material, like topsoil or peat moss are good elements to include in your substrate mix and premade mixes like Pangea ABG Premium Substrate are excellent for tropical plants. Additionally, if your plants are directly planted, you’ll most likely need to add a drainage layer so water can drain from your substrate preventing root rot, as well as adding a natural aquafer that will help keep humidity level high and stable. Another thing to consider when choosing a substrate is if your animal needs a substrate that can support burrowing. You will want to use a substrate that is good at clumping, including topsoil, peat moss, or ground coco coir in your substrate mix can help with this. Some enclosures set up for burrowing will not need a drainage layer because the tunnels will naturally aerate the substrate allowing roots to breathe. This also gives more room for burrowing and prevents your animal from becoming trapped under your drainage barrier. What plants do I want to add to my enclosure? When most people picture bioactive enclosures, they think of beautiful, lush green habitats filled with tropical plants. However, those plants may not work for your animal. In arid enclosures, for example, these plants would quickly wither and die. Here are some things we think you should consider before adding plants: Arid Setups Maintaining plants is difficult in arid enclosures. If you want to add some, we generally recommend sticking to succulents and other animal-safe desert plants. Additionally, it can be a good idea to use the double-pot method. To do so, secure one pot into your enclosure, and keep your plant in a second pot that can be stacked inside the first. This allows you to pull your plants out of the enclosure for watering so you can give them the moisture they need without flooding your enclosure. Tropical Setups Tropical habitats are the ones most people envision when thinking of bioactive enclosures. The environment opens the door to many plants, but not all will work best for you and your animal. Common vining plants such as Epipremnum, Philodendrons, and Monsteras can look amazing scaling the back wall inside terrariums. However, many of these will take over a habitat if not trimmed. Woody plants like Schefflaras and Ficus benjaminaadd climbing branches and a more forested aesthetic to your enclosure but can outgrow most enclosures. Other plants like Begonias, Allocasias, and Syngoniums are beautiful, but fragile and will be crushed by many animals. We recommend pairing delicate plants with lightweight animals, and make sure they’re hardy enough for your animal’s size and movements. Preparing your Plants While many common houseplants work well in bioactive enclosures, the pesticides and fertilizer in their soil can be very harmful. We recommend removing the soil and washing your plants before placing them in your terrarium. You can take this further by flushing your plants before you wash them, by thoroughly watering your plant’s soil with distilled or RO filtered water in the weeks leading up to planting them in your tank. Of course, you can also buy your plants ready to plant from vendors specializing in terrarium plants such as Glass Box Tropicals. What Clean-up Crew should I add to my enclosure? The last major element to consider when planning your bioactive enclosure is your clean-up crew! Detritivores are an essential addition to your enclosure for breaking down waste and plant debris. For arid enclosures, it will be difficult to keep many commonly available detritivores. However, isopods like Porcellionides pruinosisare somewhat tolerant of dryer climates. Additionally, some beetles, such as darkling beetles, are also good options for semi-arid setups. For tropical and sub-tropical terrariums, your best option will be a combination of springtails and isopods. Some isopods are better than others as a clean-up crew. We like Porcellioscaber, Porcellionidespruinosis, and Trichorhinatomentosa. However, if you plan on breeding, Trichorhina tomentosa AKA dwarf whites are known to eat reptile eggs. Your detritovores are of course there to help clean up your enclosure, but they can’t survive on waste alone. In order for them to thrive, you will need to provide them with an ample amount of leaves and occasional vegetables. Otherwise, they will likely seek out your plants for food. Some final considerations Now that you’ve got a plan for everything going into your enclosure, there are a few final considerations to think about. Importantly, do you have enough time for the enclosure to establish before introducing an animal? Typically, the best practice is to allow about a month for your plants to grow, detritovores colonies to settle, and beneficial mycelium and bacteria to establish in the substrate. If you don’t have time for it to establish before your animal needs a place to live, where will the animal live in the meantime? And of course, the last thing to think about is where you are going to source your supplies for your build, but you probably already know we’ve got what you need at pangeareptile.com! We’ve got plenty of options for substrate, wood, cork bark, hides, dishes, and isopods so you can build an incredible enclosure! Thank you for reading, and happy building!",
      "scraped_at": "2025-12-29T10:28:35.805784"
    },
    {
      "title": "Giant Blue Beauty Anole Care Guide",
      "url": "https://www.pangeareptile.com/blogs/blog/giant-blue-beauty-anole-care-guide",
      "summary": "These striking anoles truly live up to their name, Giant Blue Beauty. They are amongst the largest anole species and by far the bluest! Anolis equestris potior is a sub-species of the Cuban Knight Ano...",
      "content": "These striking anoles truly live up to their name, Giant Blue Beauty. They are amongst the largest anole species and by far the bluest! Anolis equestris potior is a sub-species of the Cuban Knight Anole (Anolis equestris equestris) is only found on the small island of Cayo Santa Maria, just a few kilometers north of the main island of Cuba. In the Giant Blue Beauty’s native habitat, they can be found on tree trunks and branches in the canopy foraging for insects, small lizards, and other invertebrates. Some omnivorous behaviors have been observed in Blue Beauty Anoles including eating fruits and even Pangea Gecko Diet. Their native climate is warm and humid, typical of the Caribbean tropics. Husbandry These gorgeous lizards have easy-to-moderate care requirements for most keepers. While Giant Blue Beauty Anoles can be more handleable then some Anolis species, they should be considered display species with limited handling. Housing Enclosure Anoles are medium bodied arboreal lizards that spend most of their time in trees. Choosing a front-opening enclosure with a screen-top that favors height over floor space is the most appropriate enclosure design for these beauties. A pair of Giant Blue Beauties will do well in 18\" x 18\" x 24\" enclosure but more room is always better. Juveniles can be housed in a 12\" x 12\" x 18\" enclosure for several months. Glass, PVC, ABS, or HDPE can all work as enclosure materials. Depending on the manufacturer, you may need to seal the seams to prevent leakage. Screen tops or other ventilation should be present to facilitate airflow. A front opening option will allow for easier access for cleaning, feeding, maintenance, etc., but will also help alleviate some of the lizard's stress when hands are in the enclosure because most predators’ anoles face come from above. Décor Being arboreal lizards, the most important items in your anole's enclosure are climbing surfaces. Branches, like Pangea Ghost Wood Branches, of different diameters that include multiple options of branches as thick or thicker than the lizard's body will facilitate their arboreal tendencies. Pangea Cork Backgrounds and cork flats can be incorporated as well. Branches should be placed vertically and diagonally with basking spots in mind. As you can see in the picture to the right they really enjoy the Pangea Ultimate Vine. A variety of substrates can be used but we recommend coconut coir like Zoo Med Eco Earth or a soil blend with some sand like Zoo Med Reptisoil. For example, a 50/25/25 mix of coconut coir, organic topsoil, and washed play sand can be used. The substrate can be 1” deep since these anoles will spend very little time on the ground, typically only when hunting. If you plan to incorporate live plants, plan on using deeper substrate. Plants are another critical item to include in your Giant Blue Beauty Anole’s enclosure. Foliage provides cover for the animal, assists in the formation microclimates, and adds a pleasing aesthetic for you. You can choose to use artificial plants for your enclosure but an excellent option for these anoles is a bioactive enclosure with live plants. To learn how to set up a bioactive enclosure, check out our blog (coming soon!). Atmosphere Coming from a small tropical island in the Caribbean, these anoles like it hot and humid, especially during the summer months. While Cuba is not equatorial, a day-night cycle with 12 hours of light and 12 hours of dark can work for them year-round, but seasonal simulation should be attempted when possible. In the wild, these beautiful lizards have a humid environment and receive regular rain, especially from May-September. To achieve similar conditions, the enclosure should be misted multiple times a day, including the morning and evening, with a hand mister or automatic mister. Misting should be thorough and if you are in a drier climate, then you may need to mist more often to achieve appropriate humidity levels. In captivity, these anoles will often be seen basking, so it is important to set their lights up properly for healthiest animals. This can be achieved with 2-3 lights. These beauties require fairly high levels UVB for adequate D3 synthesis. Anolis equestris are in Ferguson Zone 3 with an ultraviolet index (UVI) of 1.1-3.0. To achieve this UVI you can use a 10.0 UVB bulb from Zoo Med, a 12% bulb from Arcadia or a Zone 3 bulb from Reptile Systems. The necessary UV output increases as distance increases, adjustments to the bulb selection or basking spot should be made to accommodate the required UVI. In addition to UVB, these anoles require UVA and Infrared wavelengths from lighting. The best way to achieve this is with a low-wattage halogen bulb like the 50-watt Pangea Halogen bulb or the 35-watt Zoo Med Nano Halogen bulb for smaller enclosures but may need to be upgraded for larger enclosures. You should choose a bulb that is appropriate for your enclosure size. You may adjust the height of bulb or the basking branches to achieve a basking temperature around 95°F but we expand on the topic of temperatures further down this care guide. Mercury Vapor Bulbs like the Reptile Systems D3 UV Basking Lamp can be used for both UV and Heat and work great for larger enclosures. The following parameters should be used in the summer and winter, respectively, with a 1–2-month gradual transition for spring and fall. Summer The summer months in Cuba (June-Sept.) come with heat and heavy rainfall. To accomplish this, we recommend these parameters: Light: 14 hours of daylight - 10 hours of darkness Basking spot of 90°F - 100°F Ambient temperatures of 73°F - 80°F Relative Humidity of 60 - 100% Mist Daily (3x)- in the morning, mid-day, and evening. Winter The winter months in Cuba (Dec-March) are a little cooler with a little less rain. To accomplish this we recommend these parameters: Light: 10 hours of daylight - 14 hours of darkness Basking spot of 80°F - 90°F Ambient temperatures of 70°F - 75°F Relative Humidity of 60 - 100% Mist Daily (2x) - in the morning, and evening. Diet Most common feeder insects will be great for Giant Blue Beauty Anoles. Crickets, roaches, hornworms, silkworms, and other live insects can all be fed to these lizards. Feeder items should be able to pass through a space as wide as the space between the anole's eyes. Prior to feeding your anole, the insects should be fed an appropriate gut-load like Pangea Insect Grub 24-hours in advance. Feeder insects should be dusted with a calcium supplement at least every other feeding and a multivitamin once a week. Based on our experience observing basking behavior and research from other keepers in the hobby we believe that using Calcium with D3 is more beneficial than without. Conclusion Following these guidelines will certainly set you up to have success with Giant Blue Beauty Anoles but we recommend using multiple sources and continuous research as reptile husbandry and research continue to advance. If you have any questions please do not hesitate to reach out to us and we will do our best to help you.",
      "scraped_at": "2025-12-29T10:28:38.145599"
    },
    {
      "title": "Chameleon Kits by Neptune the Chameleon",
      "url": "https://www.pangeareptile.com/blogs/blog/the-ultimate-chameleon-kit-by-neptune-the-chameleon",
      "summary": "Hello readers! I am Neptune the Chameleon’s mom and have spent years educating and mentoring thousands of chameleon keepers across the globe in proper chameleon care. After seeing subpar kits and coun...",
      "content": "Hello readers! I am Neptune the Chameleon’s mom and have spent years educating and mentoring thousands of chameleon keepers across the globe in proper chameleon care. After seeing subpar kits and countless keepers struggle to know what supplies to purchase for their new chameleons, I teamed up with Pangea Reptile to give you a kit that will help your chameleon live their best life! Let’s talk through what everything in the kit does. If you learn by watching videos, be sure to check out this video: The hardest parts about keeping a chameleon as a pet are knowing what information to listen to and getting them set up correctly. I am going to encourage you to try not to deviate from the recommendations being made in this kit. There is a lot of misinformation and old products out there that are not safe or recommended to use for a chameleon which I talk about frequently on my social platforms. You can follow me @neptunethechameleon on Instagram, TikTok, YouTube, and Facebook. The Kits Advanced Chameleon Kit Basic Chameleon Kit Enclosure What enclosure does a chameleon need? First up we have the enclosure. The ZooMed XL Reptibreeze will work for either a male or female veiled, panther, or Jackson’s chameleon that is 3 months old or older. This enclosure size will work for the entirety of their life. Chameleons should be housed individually and never kept together. If you purchased a chameleon egg or a hatchling, I’d suggest looking at how to set up an enclosure for a baby chameleon. Once the enclosure is assembled you will want to provide some sort of way to raise the enclosure at least 2 feet off the ground. Most keepers use a table or nightstand, but I personally use garage shelf racks so that I can also have a way to drain the excess water. More on that later. Lighting What lights does a chameleon need? Next up let’s talk about lights. Now this can get very complicated and there is a lot of different information out there on the internet, so I will try to keep it simple. But let us first establish that there is more than one way to keep a chameleon. Basking Lights & Temperatures What I am recommending is the simplest lighting combination that has been proven to be very successful with veiled, panther, and Jackson’s chameleons. Chameleons need a white heat bulb (do not ever use red heat bulbs) to help regulate their temperatures since they are ectothermic (cold blooded). Heat bulbs should be placed on the outside of the enclosure and usually to one side/corner of the enclosure towards the back. The ideal temperature ranges will vary based on your species and sex of chameleon, but the general basking temperature for a female chameleon is 80°F and 85°F for a male chameleon. This can be measured by the thermometer provided in the kit. The 50W Pangea Halogen bulb that comes with the kit should be able to give you the correct temperatures. You may need a lower or higher wattage bulb to achieve the correct temperatures because the temperatures are dependent on how far away your basking branch is from the bulb, and the temperature in the room the chameleon is kept in. The heat bulb should be on for 12 hours and completely off at night which can be achieved with the timer that comes in the kit! Nighttime temperatures will vary per species, but all species benefit from a temperature drop at night. Veiled chameleons do best with nighttime temps of 55°-65°F, panther chameleons should be 60°-70°F, and Jackson’s chameleons should be around 50°-65°F. UVB Lighting UVB bulbs get even more complicated than heat bulbs. I am recommending you use a T5 HO Arcadia 6% or the Reptisun 5.0 UVB bulb, which is what the kit comes with. This bulb is 100% necessary and acts as the sun for your chameleon. Without the proper UVB bulb, your chameleon is at risk of developing life threatening health issues like metabolic bone disease. If you do not own a solar meter then your UVB bulb will need to be replaced every 6-12 months – just because the UVB bulb turns on, does not mean it is putting off enough UVB because the bulbs get weaker and less effective over time. You may hear some keepers recommend using a T5 Arcadia 12% or Reptisun 10.0 UVB bulb especially for veiled chameleons. This goes back to my earlier comment that there is more than one way to keep a chameleon. There has been research that demonstrates that a veiled chameleon can successfully live and produce healthy offspring underneath a 6% or 5.0 UVB. So, then we wonder as a chameleon community, is the 12% or 10.0 UVB too much UVB? Are we overdoing it? We know too much UVB is harmful to humans (sunburns, cancer, etc.) but we are still learning the long-term effects of too much UVB on chameleons. If you want to learn more about this, check out Chameleon Academy. This kit is meant for new keepers, so I do prefer to err on the side of caution and recommend you use a bulb we know for sure is safe. Your UVB bulb should be placed on the outside on top of the enclosure and does best when placed horizontally to run left to right. Plant Lighting If you purchased the Advanced kit, then you will also receive a plant LED light. I have seen a HUGE improvement in plant growth since adding one to my own enclosures. They are not necessary, but you will find it to be much easier to keep your plants alive in the enclosure if you do decide to get one. This should also be turned off at night and run alongside your UVB bulb. Your heat and UVB bulb (and plant LED light) should be on for 12 hours and off at night. Luckily for you, the kit comes with an outlet timer for you to plug your lights into and customize when they turn on and off. The specific times you pick can vary just be consistent. My lights turn on at 8am and off at 8pm. Branches What branches do I use? The kit does not come with any branches, which allows you to customize it to your chameleon’s needs and personal aesthetics. Most chameleon keepers locally source their branches. I personally use natural branches from outside and have had great success using birch wood but there’s lots of different kinds you can use. If you do decide to use natural branches from outside be sure they are washed and cleaned to avoid bringing any foreign contaminants into your enclosure. Make sure the branches you pick are not too thick. Your chameleon’s foot should be able to grip around the branch. It’s always a good idea to provide a variety of sizes of branches to give your chameleon lots of options. Avoid using bamboo because it is very slick and can be difficult for your chameleon to climb. Also avoid branches from sap producing trees because the sap may cause irritation or physical impairment, and fake bendy and or mossy vines where a wire may poke out of the vine. How do I set up the branches? The branches you put inside of the chameleon enclosure have multiple purposes. The branches are used for traveling around the enclosure, enabling proper thermoregulation, ensuring your chameleon is comfortable, holding up other décor and foliage, and also general aesthetics. Use sticks and branches to your advantage to make an awesome display but also to keep your chameleon comfortable. The first purpose of installing branches in your enclosure is to provide your chameleon pathways and highways to safely travel through the enclosure. Without a proper branch setup, it is likely your chameleon will try to climb the screen which could cause them to fall and rip out their nails. Chameleons typically move side-to-side so I would try to place your branches horizontal with a few running diagonally along the top, middle, and bottom. The branches are how your chameleon will get around, so any empty space is unused space. Every enclosure will be different but just so you have an idea, I ended up using 25 branches in my enclosure. The most important branch in your enclosure is your basking branch which is the one that will be underneath the heat bulb. It is SUPER important that this is the appropriate distance providing the correct temperatures so your chameleon will not burn themselves because chameleons are unable to recognize if the temperature is too hot and will accidentally burn themselves causing irreversible damage. If you have a baby chameleon, you will need to factor in the growth of your chameleon and adjust the branches as needed because they will get closer to the heat bulb as they grow. I recommend basking branch placement typically 4\"-6” away from the basking bulb. Mounting Branches The final purpose of the branches is to act as an anchor for you to attach your plants. Once your branches are in the enclosure you can move on to attaching your potted live plants. Branches can be attached to the screen enclosure by using fishing line, floral wire, zip ties, push pins, Dragon Ledges, etc. There’s lots of different ways you can do it, so be sure to check out my various tutorial videos for inspiration and step-by-step instructions. Plants What plants do I use in the enclosure? The plants inside of the enclosure give your chameleon additional things to climb on as well as places to hide. If you are looking for ideas on what plants to use for your chameleon’s enclosure, check out my plant playlist for tons of ideas and inspiration. Some of my favorite plants to use include pothos, begonias, philodendrons, dracaenas, and monsteras but there are lots of other plants you can use! Here is a link to the Neptune the Chameleon Plant Playlist It is important to make sure you are using live plants that are safe for your chameleon since some chameleons, especially veiled chameleons, will eat the live plants which is why fake plants are not recommended for most chameleons. Avoid using fake plants, ropes, or hammocks, and really anything besides natural branches and live plants because they have been known to cause preventable issues with chameleons. When building your enclosure, I would suggest starting at the top and working your way down when adding in your plants. Use smaller plants that do well in heat, high light, and with lots of water towards the top and then use bigger, more sturdy plants that do well in low light for the bottom of the enclosure. Remember any empty space, is unused space. A good rule of thumb is to you should be able to sit across the room and have a hard time spotting your chameleon. They need lot of plant coverage to be able to hide and feel secure. I ended up using 8 smaller plants attached to the upper branches and 3 big potted plants at the bottom. What do you put at the bottom of the enclosure? I’d recommend either making the bottom of your enclosure fully bioactive (drainage layer, bioactive soil, isopods, live plants, etc.) or putting large potted live plants. If you’re a new keeper, the potted live plants are the easier option, and you can always make your enclosure bioactive in the future. The large potted plants help catch the water from your mister and give your chameleon things to climb on. There is no need to use additional substrates like bark, reptile carpet, etc. Paper towels can be used if that will be helpful for cleaning up, but they’re not usually needed. Hydration How does a chameleon drink? Let me start off by saying there are a lot of hydration methods when it comes to chameleons. I am going to share what has worked for me and what I recommend to new chameleon keepers I mentor. I hope once you learn more about chameleon care that you feel empowered to customize your hydration schedule based on your environment and specific chameleon. Chameleons are attracted to movement with their food but also with their water. Chameleons are shy drinkers so try not to freak out if you don’t see your chameleon drink. Best Practices The general recommendation in the chameleon hobby right now is to mist 2-4 minutes in the morning before lights turn on and 2-4 minutes at night after lights turn off. Avoid spraying your chameleon directly. You will be very tempted to mist them during the day to make sure they are getting enough water – try not to do this. Instead, monitor your chameleon’s poop to make sure they are staying hydrated. If you mist during the day, you’re creating a hot and humid environment which is not ideal for a chameleon. Allow your enclosure to dry out throughout the day. Avoid using water features like a waterfall which can be hard to keep clean and sanitary for your chameleon. Misters We use a mister to help maintain the appropriate humidity levels and provide moving water for our chameleons to drink. You can manually mist your enclosure with the spray bottle that comes in the Basic Kit, or you can customize the automatic MistKing misting system that comes in the Advanced Kit to mist on a set schedule. The MistKing is a GREAT purchase so that you can automate your enclosure to be able to go on vacation and have peace of mind that your chameleon is hydrated. Not to mention your hand will thank you for not having to stand there for 2 minutes and mist. I would suggest placing your MistKing nozzle in one of the front corners so that it can point towards the center of the enclosure. You can adjust the angle of the nozzle so that it will avoid misting your walls. You also have the option to add a cool looking background to the back of your enclosure which can also help mitigate the amount of water that hits your walls. Drippers Something not included in the kit is a dripper. You can purchase these separately or even make your own! The dripper is a small container you fill with water to put above the enclosure to drip water onto your chameleon’s plants to provide additional drinking opportunities. It’s not a necessary item to have but can come in handy. Foggers If you purchased the Advanced Kit, then you also have a fogger! Foggers are used to help increase the nighttime humidity level for a chameleon. The fogger can help simulate fog rolling in at night which is what they would experience in the wild. And then they can breathe in the moist air and stay hydrated that way. Humidity Levels Below are the current humidity ranges recommended for the commonly kept species. These are general guidelines and are subject to change as the hobby is learning more about chameleon care. These numbers are measured via a hygrometer (which comes in the kit!) and are controlled by a multitude of factors including the natural humidity of where you live, how many live plants are in the enclosure, how often you’re misting, how long you are misting, if you are using a fogger, etc. Remember that you're aiming for your humidity to be higher during the night and should be 70% or higher. Daytime relative humidity Veiled chameleon: 40-50% Panther chameleon: 50-60% Jackson’s chameleon: 30-50% Nighttime relative humidity All species: 70-100% Learn more about chameleon hydration, humidity, etc. How do you deal with all the water? Between the misters, foggers, and drippers, there is a lot of water that comes with a chameleon enclosure. There are lots of different ways you can manage the water, but I will share what I do. I drill a few small holes in the bottom of the PVC floor and put my enclosure on top of a garage shelf and a bucket underneath. The water will pool towards the center and be caught in the bucket below. The rest of the water should be caught by the large potted live plants at the bottom of the enclosure. Feeding What does a chameleon eat? Chameleons are insectivores and should only be feed live bugs that have been gut-loaded and supplemented. When planning out your chameleon’s diet you need to make sure you include lots of variety, as well as making sure you are feeding them nutritious bugs. Some healthy bugs you can feed on a regular basis include crickets, dubia roaches, silkworms, black soldier fly larvae, locusts, red runner roaches, black soldier flies, blue bottle flies, hawkmoths, silk moths, wax moths, etc. Some bugs that are great to feed to your chameleon as an occasional treat would be: superworms, hornworms, wax worms and mealworms. You will want to avoid feeding your chameleon things like butterworms, earth worms, spiders, fruits & veggies, freeze dried bugs, and bugs from outside. Regulary: Crickets, dubia roaches, silkworms, black soldier fly larvae, locusts, red runner roaches, black soldier flies, blue bottle flies, hawkmoths, silk moths, and wax moths. Occasionaly: Superworms, hornworms, wax worms and mealworms. Avoid: Butterworms, earth worms, spiders, fruits & veggies, freeze dried bugs, and bugs from outside. Gut-loading It’s important that all your feeders are gut-loaded before feeding them to your chameleon Gut-loading is the process of feeding your live bugs healthy fruits and veggies before feeding the bugs to your chameleons to ensure they have the proper micronutrients. Without gut-loading, you’re basically feeding your chameleon an empty bug shell. It is important you use the correct items to gut-load with since not all fruits and veggies are created equal. Learn more about gut-loading: How do I feed a chameleon? Feeding tongs are a great tool to pick-up the live bugs that you will need to feed to your chameleon. If you are comfortable grabbing the bugs with your bare hands, go for it! That gives me the heeby jeebies so I use the tongs to pick up the various live bugs and wanted to make sure the kit included some. The tongs are not typically used to feed your chameleon directly because you can accidentally damage your chameleon’s tongue while using them. The chameleon’s tongue can get stuck to the tongs and could result in amputation. The safest method to feed your chameleon is by cup feeding where you put the bugs in a cup or feeder run. Feeder run: An object set up in an enclosure that contains feeder insects and allows them to walk on a path (often vertical) to draw the attention of a reptile. Some people choose to have the bugs run loose in the enclosure. I do not recommend tossing bugs in the enclosure because you will not be able to ensure they are gut-loaded and supplemented if they aren’t eaten right away. Additionally, it can be tricky to keep track of how much your chameleon has eaten. Make sure the bugs are moving around in the cup to catch the attention of your chameleon. Be aware that it can sometimes take a chameleon 2 weeks before they feel comfortable enough inside of their new enclosure to start eating. What supplements does a chameleon need? I briefly mentioned making sure the bugs are supplemented. Let’s dive into that a bit more. Supplementation is the process of adding powdered vitamins to the live bugs before feeding the bugs to your chameleon. These supplements are necessary if you are going to keep your chameleon indoors since they are not able to get access to natural sun and the benefits that come with it. (Putting your chameleon by a window will not suffice since house windows are built to cancel out UVB). Additionally, the supplements help balance out the improper calcium to phosphorus ratio that is present in the bugs we feed to captive chameleons such as crickets, dubia roaches, etc. Without the proper supplements your chameleon is at risk for developing health issues such as swollen eyes, metabolic bone disease, etc. Both kits come with PangeaCal without D3 and a multivitamin with D3. The supplements you use, and how often you use them will be dependent on your species. Please watch the video below to learn about proper supplement schedules: How much does a chameleon eat? How much your chameleon eats depends on the age of your chameleon. A growing baby chameleon will eat a lot more and more often than an adult chameleon who is not growing as much. Chameleons 3 months to 8-ish months should be fed once in the morning around 10-15 bugs. Try not to stress too much on the quantity of bugs since that will vary on the size of bugs you feed and your chameleon’s feeding preferences and habits. If your chameleon is consistently eating and pooping, then you are doing a good job. If they stop eating all together, then you need to investigate further and see why that might be happening. Once your chameleon is around 8-9 months old (give or take) then you can start cutting back on their food to every other day until they reach adulthood at 12 months old. Then they will eat 3-4 bugs every 2-3 days. That is a rough guideline. You should really learn the signs of an underweight, overweight, and healthy weight chameleon to help you be able to adjust their diet and quantity of bugs as needed. Additional Info What if I have a female chameleon? Something that is not included in the kit is a laying bin. If you have a female veiled or panther chameleon, you will need to provide her with a laying bin, so she has a place to lay her eggs. They will lay infertile eggs even if they have never been with or have seen a male chameleon. Jackson’s chameleons give live birth, so they don’t need a bin. Watch to learn more about egg laying and how to set up a laying bin: In conclusion I hope this helps get you started in your chameleon keeping journey! They really are such a joy to watch and take care of. Remember that the two most difficult things when it comes to chameleon keeping is getting them set up correctly and knowing what care information to listen to. Lucky for you, you have these great Kits available to you and this blog along with my hundreds of free videos on YouTube. Good luck with your chameleon! Advanced Chameleon Kit by Neptune the Chameleon XL Reptibreeze 24” Pangea Reptile T5 HO Fixture 50W Pangea Halogen Bulb Zoo Med Deep Dome Lamp Fixture Vivarium Electronics LED Light Zoo Med Terrarium Controller MistKing: Starter Zoo Med ReptiFogger: Pangea Thermometer & Hygrometer Pangea Rubber Coated Feeding Tongs PangeaCal without D3 Reptivite with D3 Basic Chameleon Kit by Neptune the Chameleon XL Reptibreeze 24” Pangea Reptile T5 HO Fixture Zoo Med Reptisun 5.0 T5 HO 50W Pangea Halogen Bulb Zilla Ceramic Heat Fixture Zoo Med Terrarium Controller Exo Terra Pressure Sprayer Pangea Thermometer & Hygrometer Pangea Rubber Coated Feeding Tongs PangeaCal without D3 Reptivite with D3",
      "scraped_at": "2025-12-29T10:28:41.461800"
    },
    {
      "title": "New Year - New Bags",
      "url": "https://www.pangeareptile.com/blogs/blog/new-year-new-bags",
      "summary": "You may have noticed the new bag designs for Pangea Gecko Diet™ while shopping on our site or maybe you even received one already. The new bags are full of fantastic new features, but our gecko diet h...",
      "content": "You may have noticed the new bag designs for Pangea Gecko Diet™ while shopping on our site or maybe you even received one already. The new bags are full of fantastic new features, but our gecko diet has remained the same nutritious and delicious food your geckos have come to know and love. Design These bright new bags have a refreshed yet familiar design. The first thing you will probably notice is that they all feature our new logo! You will see on many of our new products, and as we transition established products into their new packaging, that our Pangea gecko foot logo is on display. The gecko foot logo establishes an iconic silhouette that looks great anywhere. We are excited to feature it on our flagship gecko diets. You may notice the couple wording changes on the new bags, but rest assured you are still getting the same great recipe as before. All the wording changes are designed for consistency and clarity across our whole gecko diet line of products. Instead of the tiger crested gecko that was featured on each bag, we made each flavor feature a different morph. Our most popular flavor “with Insects” now shows off our beloved gecko, Patient Zero! Another one of our popular diets “Growth & Breeding Formula” now displays the “Cold Fusion” trait developed popularized by Tom of Geckological. Other prominent crested gecko morphs include a super dalmatian like the famous Damn Daniel on the “with Watermelon” flavor, the provocative super cappuccino morph on our “with Apricot” flavor, an axanthic gecko on our “with Papaya” flavor. Finally, we are excited to give our original flavor “Gecko Treat” its own bag in Pangea Reptile™ blue with the always stunning red patternless morph. These exciting design changes are not the only new features in our gecko diet bags. New Features Some of the most exciting elements are the new features we have implemented for the bags. As we always seek to improve our brand and products, we have listened to our customers and made some improvements to the zipper, added Pangea branded scoops to 64oz bags, and added unique authentication technology. Zipper As you may know, opening and re-sealing bags of powder does not always go as planned. With that in mind, we upgraded the zipper on our bags. This new zipper is thicker and sturdier, which offers a noticeably more satisfying closure. The zipper’s adhesion surface is wider and has a stronger glue to prevent the zipper from tearing away from the bag. This improved zipper adds security and longevity to the gecko diet inside. Scoop For those of you who buy our 64oz. bags, you can now enjoy a free branded scoop in each bag. You can portion out your gecko diets with ease using the convenience of a handled scoop. No more tipping a big bag and shaking powder everywhere each time you need to make a batch of food for your geckos. Authentication One of the most noticeable changes you will find is the QR code on the back of the bag and the unusual symbol below the QR. This advent in our packaging technology is amongst the most exciting new additions. The spirograph looking symbol is known as a guilloche and along with the corresponding QR code is unique to each bag. When you scan the QR code, the link will bring you to a page to authenticate your bag of Pangea Gecko Diet™. You will see the corresponding unique guilloche displayed on your browser. Authentication technology offers peace of mind. By simply scanning your bag with your phone, you can know that you have received an unadulterated, non-counterfeit, authentic Pangea Gecko Diet™. We are happy to implement this new element into our gecko diets to assure our customers they are receiving only the best crested gecko diets in the world! Pangea and You Many of the new features to our Pangea Gecko Diet™ bags have come from suggestions from customers like you. We love feedback on our products and services so we can learn how to better serve our most important asset – you! Please let us know what you think of the new bags below and feel free to give us suggestions on any of our products here.",
      "scraped_at": "2025-12-29T10:28:43.842533"
    },
    {
      "title": "Help USARK Fight For Your Rights",
      "url": "https://www.pangeareptile.com/blogs/blog/help-usark-fight-for-your-rights",
      "summary": "The United States Association of Reptile Keepers (USARK) is our frontline defense against Lacy Act amendments. They are a 501(c)(6) nonprofit organization that protects the freedom of responsible rept...",
      "content": "The United States Association of Reptile Keepers (USARK) is our frontline defense against Lacy Act amendments. They are a 501(c)(6) nonprofit organization that protects the freedom of responsible reptile keeping through education, litigation, and conservation. As the voice of the industry, USARK advocates for the responsible private ownership and trade of reptiles and amphibians across the country. USARK Mission Statement “USARK is a science, education and conservation-based advocacy for the responsible private ownership of, and trade in reptiles and amphibians. We endorse caging standards, sound husbandry, escape prevention protocols, and an integrated approach to vital conservation issues. Our goal is to facilitate cooperation between government agencies, the scientific community, and the private sector in order to produce policy proposals that will effectively address important husbandry and conservation issues. The health of these animals, public safety and maintaining ecological integrity are our primary concerns.” Urgent Action Needed! You Can Help! Join USARK - Become a member and help support the organization that is fighting for your rights as a keeper. Subscribe to USARK emails or social media to stay up to date and informed on when and how laws are changed. Call, Email, & Mail your government representatives! Use this link to get your Senator or Representative's contact information and what to say! Join and support USARK today! USARK Webpage: https://usark.org/ USARK Memberships: https://usark.org/memberships/ ALERTS: https://usark.org/alerts/ Lacey Act Pages: https://usark.org/2022lacey/ Contact your Representatives: https://usark.org/calltoaction/ What is happening? Right now, USARK is fighting to protect our rights as hobbyists and breeders for keeping reptiles, amphibians, and other animals. Specifically, USARK is trying to negotiate laws that are trying to broadly ban animal transportation, called “whitelist” versus a “blacklist”, which only hand selected species of concern are banned. Pangea and USARK Pangea has been a long time advocate of USARK and is a Gold Member. You can help support USARK and apply for a membership with this link: https://usark.org/memberships/ At Pangea, we are trying to raise awareness and will be giving out postcards that can be mailed to your Senator or Representative with every order (until we run out of postcards). Pangea is hosting a fundraiser where 10% of profits purchased through the website from June 24th, 2022 – June 30th, 2022 will be donated to USARK. During this time, Pangea will also be sending out FREE T-shirts to randomly selected winners. About Lacy Act Amendments Below are several questions that are directly tied to Lacy Act amendments and responses from USARK to those questions. Q: What animals are affected? This could impact almost any species of animal. Species of fish, reptile, amphibian, bird, and invertebrates could be listed/affected. The only species that would be safe from these Lacey Act amendments are common, domesticated animals such as dogs, cats, and traditional livestock. Q: What does it do? Briefly: A ban on interstate transportation and importation of every species currently listed as “injurious” would be enacted, even for species that could not survive in most of the U.S. (Note: importation is currently banned.) A new “emergency designation” would be granted that would allow species to be classified as “injurious” without due process, justification, or prior notice. Only a limited number of species named to a “white list” (not yet written) would be approved to enter the U.S. Q: What is the white list? A white list is the opposite of a black list, or ban list. Typically, bills include black/ban lists of species that state what species are not allowed. A white list includes the species that are allowed. If a species is not on the white list, then it is not allowed. In this case, the white list will determine what species can be imported into the U.S. Q: What species are on the white list? There is no compiled white list at this time. That will happen only if the amendments pass. No one knows what species will make the white list. All we know is that a species had to be imported or transported interstate in “greater than minimal quantities” in the one year prior to the enactment date to even be potentially included on the white list. Q: How will FWS create the white list? (FWS = U.S. Fish and Wildlife Service) Only species that were imported or transported interstate in “minimal quantities” during the one-year period prior to enactment will be potential candidates for the white list. FWS must define minimal quantities within one year after enactment. Q: What data will FWS use to create the white list? We do not know. This is a huge problem. For example, FWS does not have accurate or sufficient data on many of the species imported into the U.S., nor those transported interstate. CITES and/or ESA data is sometimes all that is collected. If species are not listed under CITES or ESA they may just be imported as a generic animal (i.e. tropical fish). CITES = Convention on International Trade in Endangered Species and ESA = Endangered Species Act Q: What is the new emergency designation? The new emergency designation allows FWS to list species as injurious without due process. The listing would take effect immediately upon publication in the Federal Register. There may be a delayed effective date of up to 60 days, but only if FWS allows such. After an emergency listing, FWS may take up to three years to justify the listing. They may also decide not to permanently add the species to the injurious list. Q: Did the bill change names? HR4521 is still the America COMPETES Act but it will be merged with S1260. The reconciled bill has had several bill changes already. Currently, it is titled the Bipartisan Innovation Act. Q: Where are we in the process? (updated 3/15/22) HR4521 that contained the Lacey Act amendments of concern passed the House with a split vote on February 4. HR4521 will not be voted on by the Senate. Instead, HR4521 will be reconciled (or merged) with S1260. There have been delays due to a Senate recess, priority on budget, and other reasons. A conference committee should be formed to merge the two bills. It is anticipated that a formal conference committee will be formed by early/mid-April. Once created, this committee will review HR4521 and S1260. The bills will be reconciled with one final version emerging from the committee. The primary goal of S1260/HR4521 to improve America’s economic strength in the technology fields is a priority so this will be a high priority for Congress. As stated, our goal is not to stop the reconciled bill but to stop the Lacey Act amendments from being included. Q: Do I need to get rid of my animals if this passes? No. The federal law would not ban possession. Only if individual states took action might you need to rehome/surrender your animals. Q: What is S1260? As USARK reported on January 28, S1260 is the Senate version of HR4521 and is titled the U.S. Innovation and Competition Act (USICA). S1260 does not contain these Lacey Act amendments. Q: How is USARK so sure they have the right interpretation? We are very plainly stating what the legislation would do, how the Lacey Act will be amended, and what new authority FWS would have. We understand the legislative language can be confusing. USARK’s analysis of the Lacey Act amendments in Section 71102 of the America COMPETES Act (HR4521) has been vetted by numerous attorneys, legislative experts, and other authorities. Q: Does the white list apply to every state? This is a federal law and the white list applies to importation into the U.S. Individual states can write their own laws that are more restrictive, but not less restrictive than the federal law. This means states cannot opt to allow for interstate movement of species listed as injurious. It is possible that states may write laws that reflect the federal law regarding the white list and could ban species not on the white list (or even species that are on the white list) as they see fit. Q: Are injurious species banned from possession/ownership? No. If a species is listed as injurious it is not banned from possession. However, individual states may choose to ban the possession of injurious species (or other species), as we have seen previously. Q: Can I breed and sell injurious species? Yes. As long as a species is not banned by state law, you can breed and sell that species within the same state (intrastate), even if it is listed as injurious by FWS. If these amendments pass, it would become illegal to transport them across state lines. However, state or local laws may place further restrictions on species. Q: Does a species need to be invasive in most of the U.S. to be listed as injurious? No. A species may be listed as injurious even if it is not invasive in the U.S. If there is even an interpreted possibility it might become invasive, it could be listed, as we have already seen. Also, while that invasive threat can be limited to an isolated area, like southern Florida, the species could still be federally listed as injurious and banned from movement between any of the states. Even if the potentially affected state has already banned or regulated the species, FWS can still list it as injurious. Q: What does injurious mean? Per FWS, a species may be listed if it could be, “injurious to human beings, to the interests of agriculture, horticulture, forestry, or to wildlife or the wildlife resources of the United States.“ In some cases, injurious is the same as “invasive.” If a species could potentially be invasive and cause any type of harm anywhere in the U.S. then it could be listed as injurious. Listings can also occur because a species might carry/transport a disease. We saw this when FWS used an emergency rule to list 201 species of salamanders as injurious due to the concern that an animal might have Bsal (Batrachochytrium salamandrivorans) chytrid fungus. Other reasons could generate listings such as possible threats to human health or agriculture. Q: Does this only apply to commerce/sales across state lines? No. If passed, all interstate movement, for any reason, would be banned. It would even be illegal to take an animal across state lines for veterinary care, or job/family relocation. Q: Are military members exempt? No. This would hit military service men and women especially hard as they are relocated often. Not even active-duty service members would be allowed to take pets listed as injurious with them across state lines. Q: Are there any articles about this? Yes. There are several articles, podcasts, videos, and interviews on this topic now. Below are two articles: article by USARK: https://usark.org/2022lacey1/ article by Art Perola and posted by NAIA: https://usark.org/federal-legislation-threatens-pets-zoos-and-aquariums-and-biomedical-research/ Veterinarians voice concerns about proposed Lacey Act amendment by Jennifer Fiala via URL: https://usark.org/lacey1a/ Q: Do we know when Congress will vote? There is not a set timeline and a formal reconciliation of HR4521 and S1260 has not yet started. Any bill would need to pass before the end of session in December. 2022 is the second year of the two-year session (117th session of Congress). Q: Should I contact the local offices for my legislators? Yes! Call the district House and Senate offices (those not in D.C.) and speak directly to staff. Politely explain who you are, what you do, and why you are opposed. District offices have a direct line to the D.C. offices. If you have a business or facility, you can invite staff to visit. Representatives and Senators will have offices in both D.C. and in their states of representation. District office phone numbers will be listed with the contact information on legislator websites. Q: Should I meet with my legislators? Yes! You should definitely request meetings with legislators. Be prepared (read our alert and Talking Points at https://usark.org/2022lacey/) and be professional. Never feel intimidated. Your taxes pay their salaries and they are there to listen. Also, if you meet with staff, that is fine. They will pass along your message to the legislators. Q: Can I just get a license to take my animal with me to a new state? No. There are some very limited exemptions that allow for such a license but almost no one would be eligible. I am against illegal wildlife trafficking and this sounds like a good thing! While another section of the Lacey Act is used to address wildlife trafficking, that is not what these amendments are about. This has nothing to do with wildlife trafficking. Q: Will this help shut down illegal wildlife trafficking? No. Illegal wildlife trafficking is already illegal, obviously. Misapplied laws like this only encourage and increase criminal activities because it drives the prices up for black market animals. This action is actually counterproductive to halting illegal trafficking. Q: My Senator responded and said that the Lacey Act amendments were removed from the Senate COMPETES Act, so the coast is clear, right? There is no Senate COMPETES Act. The America COMPETES is a House bill. The Senate version of the America COMPETES Act is S1260 and that bill never contained the Lacey Act amendments (so it would be impossible to remove them since they were never there to begin with). Also know that most responses are pre-written and not written exclusively in response to your emails/letters. My Senator responded and said that the Lacey Act amendments don’t do what you said they do. Federal legislators and staff are working on many issues. There may be miscommunication or a mistake as to the issue being discussed. The legislator or staff may also not have a good understanding of these Lacey Act amendments. Additionally, remember that legislators do not enforce laws! Once a bill becomes a law, the enforcement agency (in this case it is FWS) must write its regulation that reflects the legislation. The regulation will be much more complex than the legislative statute. Q: How does the transportation ban work? If passed, it will become illegal to transport any species listed as injurious under the Lacey Act across state lines. It is already illegal to import an injurious species into the U.S. Q: What happens with species not included on the white list? Species not on the white list cannot be imported into the U.S. These species would not be banned from interstate transport unless also listed as injurious. Note that this is how the statute would read, but this could change during either the legislative or FWS rulemaking process. Q: How can I help stop this? Contact your legislator with your opposition! We have instructions and more in our alert at https://USARK.org/2022Lacey/. Q: I read that amendment 599 removed this section about the Lacey Act. That is wrong. Amendment 599 to HR4521 was proposed by Arkansas Representative Crawford but it was not added to the bill. Amendment 599 would have removed Section 71102 from HR4521 if it had received enough votes. People who were unfamiliar with the legislative process were misreading what was posted by the House Committee on Rules. Q: I want more information! Can you send me a private message? All available details are included in our alert and related posts. Q: Does it never end? It really does not end. No one court case or legislative discussion will stop issues like these from coming up. Proposed legislation/regulation can happen at any time at any level of government (federal, state, county, or city). This is why USARK tirelessly watches for such issues and creates alerts that make it easy for you to learn and take action. We must always be vigilant. Q: What politician was responsible? We do not know which politician is responsible for Section 71102 of the America COMPETES Act (HR4521). We only know that HR4521 was originally introduced on 7/19/21 as the Bioeconomy Research and Development Act of 2021 (did not initially contain the Lacey Act amendments), sat without a hearing, and then reemerged as the America COMPETES Act on 1/28/22 (the same day that USARK found and reported the problem) with Section 71102. Q: Does this include invertebrates? Yes. We know that aquatic invertebrates are included. While the legislation does not mention terrestrial invertebrates, FWS can regulate terrestrial invertebrates (i.e., Endangered Species Act), and terrestrial invertebrates are included in the FWS definition of wildlife: “Wildlife is any living or dead wild animal, its parts, and products made from it. Wildlife not only includes mammals, birds, reptiles, amphibians, and fish, but also invertebrates such as insects, crustaceans, arthropods, molluscs and coelenterates.” – FWS Also, within the Lacey Act the term “fish or wildlife” means: any wild animal, whether alive or dead, including without limitation any wild mammal, bird, reptile, amphibian, fish, mollusk, crustacean, arthropod, coelenterate, or other invertebrate, whether or not bred, hatched, or born in captivity, and includes any part, product, egg, or offspring thereof. Q: This only includes wild animals so the animals I breed are okay to sell and move across the U.S., right? Wrong. Animals will be listed by species. It does not matter if the animals are wild-caught or bred under human care. It also does not matter if the animals have wild-type coloration or a “morph” pattern/coloration. Some people are confused because the language reads, “…wild mammals, wild birds, fish (including mollusks and crustacea), amphibians, or reptiles, or the offspring or eggs of any such species…” What matters is the species of the animal. Q: What is the effective date? The effective date is one year after the date of enactment (date it is signed into law). Q: USARK is the only group I see talking about this. If this was so bad, other groups would have alerts. Many other groups do have alerts and are opposing these amendments. Just because you have not seen it does not mean it is not happening. Groups/businesses/keepers in aquaculture, aviculture, and mammals are all opposing this, along with herpetoculturists and USARK. Q: Where can I read the Lacey Act amendments? You can read Section 71102 of HR4521 at https://USARK.org/wp-content/uploads/2022/01/2022-HR4521-excerpt.pdf. This language is the same as found in S626. You can read S626 at https://USARK.org/wp-content/uploads/2021/03/2021-S626-Lacey-Act.pdf. Q: I heard HR4521 changed before it was sent to the Senate. Are these Lacey Act amendments still there? Yes. The final HR4521 text that was sent to the Senate after additional House floor amendments were added is 3,610 pages. The Lacey Act amendments found in Section 71102 now begin on page 2,060. You can read the full bill at https://USARK.org/wp-content/uploads/2022/02/2022-HR4521-COMPETES-final.pdf. Q: I saw an animal group supporting this. Why do they support it? Animal rights groups (groups trying to ban and remove all animals from our lives) are supporting this effort. They typically provide misinformation about what these amendments will do in order to gain further support. We have even seen them lie and say this will not affect common pet species. This is simply not true! No one knows what species will be listed and we have already seen common pet species listed as injurious. These animal rights groups have no problem with misleading the public and spending lots of money to create and distribute their agenda pushing propaganda (rather than actually helping animals or conservation as they claim to do). Q: Why does USARK not know about S1260? We do! We posted this bill by its name, the U.S. Innovation and Competition Act (USICA), on January 28 with our original alert. We have been talking about USICA/S1260 since day one. Q: Why does USARK not know about the conference committee? We do know about it! We have been discussing HR4521 and S1260 being reconciled (which is what happens with two similar bills in a conference committee) for many weeks and before anyone else reported this (that we are aware of). Q: Can individual states overturn/oppose the Lacey Act amendments if they pass? No. States cannot allow federally listed injurious species to be transported across state lines. Q: Why aren’t you telling people that this is only being supported along party lines? While the legislative issues we post about may sometimes appear to be tied up in partisan politics, the activists pushing for these initiatives are not limited to working with only one party or another. HR4521 did pass along party lines (Democratic support) and we reported the 222 to 210 vote the day it passed the House. However, S626 is sponsored by a Republican. I read that the Lacey Act amendments were only proposed as an amendment to HR4521 but did not get added to the bill. This is wrong. There was another amendment to the Lacey Act introduced as HR4521 Amendment 252 by Illinois Representative Quigley. This was an amendment version of the Big Cat Public Safety Act regarding large cats (lions, tigers, etc.). This is a very different Lacey Act amendment. Persons not well-versed with the Congressional amendment process misread what was posted by the House Committee on Rules. Amendment 252 was withdrawn. Q: Why was this added as a last-minute amendment to HR4521? These Lacey Act amendments were not a formal amendment to HR4521. They comprise a section of HR4521 (Section 71102). Since this section was included within the text of the America COMPETES Act, it is not actually a formal amendment to the America COMPETES Act. I spoke to a legislator’s office and they said that the species I work with will be okay because it is common in trade. This is wrong. First, legislators and their staff do not enforce laws. Law enforcement officers for FWS will be enforcing this law and they must enforce what the law says, not what a legislative staff person told you. Second, just because a species is common in trade does not mean it will not be listed as injurious. Some species already listed were common in trade but they were still listed as injurious. Being common in trade also does not mean it will be automatically added onto the white list. This will not impact animal species already being imported, traded, or transported. There is an exemption clause. This is wrong. Only species imported in “minimal quantities” would qualify for the new importation white list. Qualifying does not mean they will be included on the white list. Not only must they have been imported and/or transported interstate within the one year before enactment (not two or more years ago), but they must also have been imported in “greater than minimal quantities.” FWS gets to define minimal quantity later. Additionally, even if a species has been heavily represented in trade, it can still be listed as injurious and we have witnessed this. There is no exemption that makes any species automatically safe. As mentioned previously, there is also insufficient data for importation on many species and possibly no good data for interstate transportation. Q: Can species be included on the white list even if they are not imported in greater than minimal quantities? Yes, but it is an exhaustive process that must be paid for by the appropriate industry/businesses. Only the Secretary of the Department of Interior (FWS falls under the Department of the Interior) can add a species not meeting the “imported in greater than quantities” qualifier to the white list, if it “does not pose a significant risk of invasiveness to the United States.” This means it cannot be invasive anywhere in the United States. Research findings (paid for by the relevant industry) would need to prove this. If those against us (they are very well funded) did their own science that disagreed, then FWS could choose either finding for the basis of their ruling. I read that this applies only to high-risk invasive species. This is incorrect. We have already witnessed listings for species that may be able to become invasive and also listings for reasons other than invasive potential. USARK is the only organization that I know of that interprets the Lacey Act Amendments to mean that if a species is not on either white or black (deemed injurious) list, then this species can be transported across state lines. Everyone else says “not on white list” = “automatically on black list.” We have properly conveyed what is stated in the bill. This portion of the Lacey Act amendments is titled “PRESUMPTIVE PROHIBITION ON IMPORTATION.” Additionally, the text clearly states, “IMPORTATION into the United States of any species of wild mammals, wild birds, fish (including mollusks and crustacea), amphibians, or reptiles, or the offspring or eggs of any such species,…” Again, it clearly states the white list only applies to importation. However, we could see states banning species that do not appear on the FWS white list. Additionally, FWS could list every species that does not appear on the white list as injurious utilizing its new emergency designation. For instance, FWS could make a ruling that it is a risk to transport species not on the white list interstate until they can determine if a species cannot be invasive. Species not appearing on the white list would be in a constant limbo of being listed as injurious at any time. The short answer is that the bill would not ban interstate transport of species not on the white list, but that interstate ban is still a possibility for species not on the white list (even if they are not formally listed as injurious). There is no way to be certain that species not on the white list could still be transported interstate after this is final (if it passes) and goes through FWS rulemaking. Q: I got a response from my legislator saying he/she supports this! What can I do now? Please read the reply carefully. Many legislators have automatic reply emails. You may get a canned response supporting animal welfare, for example, and not these Lacey Act amendments specifically. Even if a legislator states he/she may support these Lacey Act amendments, that does not mean you cannot continue to educate. Remember that legislators and their staff are working on many issues and may not have a good grasp on the consequences. It is okay to be a squeaky wheel and send multiple messages. It is also very unlikely that a legislator had time to read your email and reply exclusively to you. Canned emails are written and then just sent as replies to people on a certain topic that may be as broad as “animal.” I heard this only applies to minks and mink farming. There is an amendment to HR4521 that bans “import, export, transport, sale, receipt, acquirement, or purchase in interstate or foreign commerce of mink [dead or alive].” That is separate from the Lacey Act amendments we are directly concerned with, but the mink ban also amends the Lacey Act. Our alert regards section 71102 of HR4521 as it was introduced when retitled the America COMPETES Act. The mink issue was an amendment to HR4521 added on the House floor. Join and support USArk today! USARK Memberships https://usark.org/memberships/ ALERTS https://usark.org/alerts/ Lacey Act Pages https://usark.org/2022lacey/",
      "scraped_at": "2025-12-29T10:28:46.716835"
    },
    {
      "title": "Mantid Madness",
      "url": "https://www.pangeareptile.com/blogs/blog/mantid-madness",
      "summary": "Even if you don't like bugs, you'll get a kick out of these amazing creatures. Mantids are one of the most diverse groups of insects with some incredible adaptations and stunning beauty. They are easy...",
      "content": "Even if you don't like bugs, you'll get a kick out of these amazing creatures. Mantids are one of the most diverse groups of insects with some incredible adaptations and stunning beauty. They are easy to keep but please do your research before jumping in. Links to mantis websites Care and breeding More Care and breeding Mantids for sale More Mantids for sale",
      "scraped_at": "2025-12-29T10:28:50.328035"
    },
    {
      "title": "Breeding Eurydactylodes spp.",
      "url": "https://www.pangeareptile.com/blogs/blog/breeding-eurydactylodes",
      "summary": "Now that we have covered the basic care requirements, we can focus on how to breed Eurydactylodesspp. First things first, let's figure out what sex your geckos are. Mature males are very easy to disti...",
      "content": "Now that we have covered the basic care requirements, we can focus on how to breed Eurydactylodesspp. First things first, let's figure out what sex your geckos are. Mature males are very easy to distinguish from mature females as they have a rather obvious hemipenal bulge and prominent waxy and often yellow femoral pores. Females lack both of these features as demonstrated in our handy dandy pictures below. Sexing juvenile Eurydactylodesspp. is a bit more tricky, as they do not develop the bulge until maturity. Males can develop pores as early as 2-3 months old and experienced keepers can usually sex them at this point using a loupe. But things are not always they seem because females can display pseudopores which look very similar to male pores. A trained eye can tell the difference but unfortunately, it is something that comes with experience. In general, female pseudopores do not have waxy-yellow extrusions coming out of the pores. Additionally, the pores are typically centered in a small diamond pattern opposed to all the way across the legs. Nutrition Successful reproduction is heavily dependent on what you feed your breeders. As with most species the more variety you can include in their diet, the better. While Eurydactylodesspp. can survive and reproduce on prepared gecko diets alone, they will thrive and be more prolific when offered live gut loaded insects once or twice a week. We offer smaller sized crickets as well as dubia roach nymphs. We dust the insects with calcium with D3 powder every time we feed insects, and we mix in a Herptivite multivitamin with the calcium one feeding per month. In addition to that, we offer prepared gecko diet 2 or 3 times per week. Seasons Seasonal cues play a role in the breeding cycle of these geckos. Shorter days and cooler temps will \"turn off\" breeding and egg laying. Our gecko room falls to around 68-72 F during the winter months which effectively tells them it's time for a break. Two to three months of cooler days and less than 12 hours of light is recommended as a rest period after which you can resume normal temperature and light cycles to stimulate breeding behavior. Pairing These guys breed readily when housed as pairs or trios. Having more than 2 females with the male seems to result in less breeding and egg laying. Only a single male should ever be housed with the female(s) to prevent fighting. The pairs or trios can be housed together year round. Having healthy, well fed, and properly housed pairs or trios will result in breeding and egg laying. Egg Laying Sites Your egg laying container should be at least 4 inches deep as Eurydactylodes like to bury their eggs fairly deep. We find the Gladware type containers work nicely. Fill the container with a 50:50 mix of peat moss and vermiculite and make sure it always stays damp but not soaking wet. Check for eggs regularly, you can often see a dig spot. Both species are notorious for laying eggs outside of the lay box, but they typically are bad eggs. Eggs and IncubationOnce the eggs are laid they should be removed and placed into an egg container with moist but not soaking wet incubation medium. We like Pangea Hatch or Vermiculite for the medium. The lid should be opened every 4-7 days to check on the eggs and to refresh the air inside. We leave the container in our reptile room which stays 73-75 degrees and eggs hatch in 70-90 days. Hatchling CareHatchlings are cared for exactly the same way as adults with a little more care placed on making sure they get misted regularly and heavily enough to allow ample time to drink the droplets of water. Dehydration is the most common cause of failure to thrive with these two species. That being said, keeping them too wet and without enough ventilation is equally detrimental as it can cause respiratory infections. Good airflow is essential and will allow the enclosure to dry up between mistings.",
      "scraped_at": "2025-12-29T10:28:53.658364"
    },
    {
      "title": "Eurydactylodes Care & Information",
      "url": "https://www.pangeareptile.com/blogs/blog/eurydactylodes-care-information",
      "summary": "Welcome to our care and information article on the Eurydactylodes (yuree-dactyl-loadees). If this is your first time hearing about these guys, congratulations on discovering one of the most unique and...",
      "content": "Welcome to our care and information article on the Eurydactylodes (yuree-dactyl-loadees). If this is your first time hearing about these guys, congratulations on discovering one of the most unique and interesting geckos around! The Eurydactylodes genus consists of four species, E. agricolae, E. vieillardi, E. occidentalis and E. symmetricus. The two that are regularly available in the hobby are E. agricolae and E. vieillardi and this article will focus on those two specifically. All species are endemic to New Caledonia and inhabit the maquis scrub and sclerophyll forests. They can be found hanging out in low lying shrubs or similar vegetation. (Herpetofauna of New Caledonia; Aaron M. Bauer, R.A. Sadlier) These arboreal geckos rarely leave the vegetation and tend to remain out in the relative open even during the day rather than seeking out hiding places or shelters. They have strong feet and tails which allow them to cling rather tightly to small vines and branches. They are primarily nocturnal but do move about to some degree during the day. There are some common names for these geckos like Bauer's Chameleon Gecko for E. agricolae and Vieillardi's Chameleon Gecko for E. vieillardi. The common names have not really stuck and people generally just refer to them by their species name. People have different pronunciations for the species name which can at times be hilarious when trying to communicate with people who say it differently. We pronounce the names like this; agricolae (agri-cole-ee) and vieillardi (vai-lard-ee). Eurydactylodes vieillardi vs. Eurydactylodes agricolae Many folks wonder what the difference is between these two species. Which ones are more expensive, which ones get bigger or are prettier, and how on earth do I tell the difference between the two? To answer some of these burning questions, I'll start with \"which species is more expensive?\" Sometimes both species can be found at the same price but typically E. vieillardi are just barely more expensive. The other two species, E. occidentalis and E. symmetricus, are relatively easy to find these days, but E. symmetricus remaining exceedingly rare and thus the highest price. The difference in price seems to be born out of pure economics rather than one being more aesthetically desirable than the other. \"Which species gets larger?\" All species max out around the same length for snout to vent length (SVL), except E. occidentalis is 10 mm smaller in SVL. There is some size variation for adults in general though and an average total length being around 4.5-5.5 inches in total length. Males are smaller than the females and are usually a little more brightly colored. On the question of which one is prettier, it's really a matter of personal opinion so we'll let you make up your own mind on that one. Telling the difference between the species can be tricky at times. Eurydactylodes vieillardi have more well-defined scales, which allows experienced keepers to be able to tell the difference pretty easily. The most reliable way to tell which species you are dealing with is the yellow band, which for E. agricolae, extends from the mouth to the ear cavity. The band does not reach the ear cavity in E. vieillardi. Care Eurydactylodes are fairly easy to care for as they do not have stringent requirements as far as housing, temperature, humidity or feeding. They do require a little more effort to keep properly than other New Caledonian geckos but nothing that is beyond an intermediate keepers ability. HousingHatchling to juvenile size specimens can be housed in plastic kritter keeper type enclosures or small glass terrariums. The medium or large Herp Haven kritter keeper is what we use until they are big enough to graduate to a permanent enclosure. As adults, they can easily be housed in a 12x12x18 Exo Terra Terrarium singly, as pairs or as trios. Adult males will probably fight if housed together so make sure you have only one male per enclosure. The most important aspect of their set up is that they have plenty of climbing vines, branches or plants with a diameter small enough for them to fully grip onto. Larger diameter branches will not be utilized nearly as much so pay close attention to what you choose to use for climbing, keeping in mind they will spend nearly 100% of their time here. FeedingOffer insects as well as fruit-based gecko diets. Hatchlings should be offered either pinhead to 10 day old crickets or flightless fruit flies, both of which should be dusted with a calcium and vitamin D3 powder. They do not seem to like large prey items so keep that in mind when selecting food items. Adults can handle 1/4 inch to 1/2 inch sized crickets or similarly sized feeder roaches. Feed them insects at least 2-3 times per week and Pangea Fruit Mix Gecko Diets 2-3 times per week. Ours seem to prefer the Watermelon variety as well as the With Insects variety. Light & HeatThese guys actually like to bask from time to time so we recommend a small wattage heat lamp at the top of their cage during the day. The light can be completely turned off at night allowing for a natural temperature drop. A 25-40 watt bulb should do the trick depending on ambient room temperature and the size of the tank. The basking spot should be the hottest spot in the cage should reach 82-85 F (27-29 C). Make sure to get yourself a good digital thermometer and measure temps at the basking spot as well as throughout the cage.There absolutely has to be enough space in the cage for them to retreat to an area that is closer to 75 degrees F (23-32 C). If the room they are in begins to get warm you should turn off the basking light. As a guideline, the temperatures should be kept between 70-75 F (21-24 C) not including the basking spot.Are basking spots really necessary? No, many keepers do not use them at all and have great success as long as the ambient temperatures are acceptable. Since basking appears to be a natural behavior for them we think it should be provided at least once they graduate to their permanent enclosure.What About UVB? Again many keepers do not use any UVB lighting and have zero problems. Those that do provide access to UVB lights report that their geckos are more active and have better, more vibrant color. Since these geckos do not hide away during the day it would make sense that they do get some exposure to UVB in the wild and may benefit from it in captivity. The verdict for UVB is that it's optional but recommended.These geckos are a riot to watch at night when they are active. To view them more easily at night you can employ a red or blue reptile night light. There are many options and the most important factor would be to choose one that will not overheat them. If room allows, the Exo Terra Day/Night LED or the Exo Terra Full Moon LED work nicely for this. Water & HumiditySeeking out standing water to drink from does not come naturally to these guys, so it is important to mist them once or twice a day with enough water to provide droplets on the foliage and sides of the tank for them to lick up. There is no need to drench the tank with water, mist thoroughly while making sure that their enclosure dries completely between mistings. Even though they do not typically drink from dishes we always make sure there is a shallow dish of clean water with them as a backup source. A thirsty gecko will drink wherever it finds water. HandlingYou can handle your geckos if you choose to. Once they become used to it they are very mellow and will just cling to your finger or hand without much fussing about. They are not fast moving and rarely bite. Handling should be limited to 15 minutes or so a day so that they do not become stressed. Newly acquired animals should always be left alone for at least two weeks so they can acclimate to their new surroundings. Hatchlings should not be handled except to move them to a clean cage. Once they are 3 months old you can begin handling them starting with just a minute or two at a time and working your way up. Behavior - Unique defense mechanismWhen threatened or agitated, E. agricolae and E. vieillardi are capable of secreting a pungent smelling sticky substance from the caudal glands located in their tails. The science is still not out on exactly what this goo is, so nobody can really laugh at you when you call it \"the weird, stinky, mystery goo\". The secretions do not seem to irritate human skin but there are reports of it causing very intense irritation to the eyes. If you are unfortunate enough to get slimed, it goes without saying, wash up immediately. If you get the goo in your eyes, flush you eyes for 10-15 minutes. If the irritation does not subsided after a day, you may need to seek medical guidance. Geckos that are used to human interaction will not do this as long as care is taken not to startle them too much. Pinching the tail may cause the gecko's to also shoot their goo though.One of the great aspects of this genus is they do not autotomize their tails, meaning they do not drop them voluntarily in response to predators or extreme stress. If the tail is somehow severed partially or completely, it will regenerate.",
      "scraped_at": "2025-12-29T10:28:56.122657"
    }
  ]
}